doc/log/0002_Lazy-Dynamic-Module-Init.org
#+TITLE: Lazy Load, Dynamic modules, initialized

So far there is just a start at the API and FFI in the RT. Here's a lot more.

* Gerbil time

*Quasar* uses *Vue.js* components[fn:vc] and I've really come to like that
approach.

Creating a ~component~ in *Gerbil* is the first step.

** Base Example to Gerbil!

The first example looks like this.

#+begin_src javascript
// Define a new component called button-counter
Vue.component('button-counter', {
  data: function () {
    return {
      count: 0
    }
  },
  template: '<button v-on:click="count++">You clicked me {{ count }} times.</button>'
})
#+end_src

I want to make it sexp.

#+begin_src scheme
(vue#component
 name: "button-counter"
 data: [count: 0]
 template: '|<button v-on:click="count++">You clicked me {{ count }} times.</button>|)
#+end_src

We'll make a standalone component and import it to *Quasar*

#+begin_src javascript :tangle ../../public/test-js-component.js
export default {
  name: 'ButtonCounter',
  data: function () {
    return {
      count: 0
    }
  },
  template: '<button v-on:click="count++">JS:You clicked me {{ count }} times.</button>'
}

#+end_src

We'll make the template form ~<js-button-counter></js-button-counter>~. *Vue.js*
has "Local Registration"[fn:vlr]. The ~name:~ matters not and we're not using
~Vue.component(<name>, ...)~ but rather "ES2015 modules, such as through [...]
Webpack"

So, import the default with a very specific name.

#+begin_src javascript :noweb-ref js-import-test
import jsButtonCounter from 'app/public/test-js-component.js'
#+end_src

Now in the component itself there's a field to import. And "For each property in
the components object, the key will be the name of the custom element, while the
value will contain the options object for the component."[fn:vlr]

#+begin_src javascript
  components: { jsButtonCounter },
#+end_src

Wait, no key? "in ES2015+, placing a variable name like ComponentA inside an object is shorthand for ComponentA: ComponentA"[fn:vlr].

Ok, but I want ~<js-button-counter>~ in kebab-case, do I need a key?

"When defining a component with PascalCase, you can use either case when
referencing its custom element. That means both ~<my-component-name>~ and
~<MyComponentName>~ are acceptable."[fn:vunc]

Yay! Adding the tag to our index and it ... fails to build.
#+begin_src html :noweb-ref js-button-counter
<js-button-counter></js-button-counter>
#+end_src

I had to add the compiler to the ~build:~ property in ~quasar.conf.js~. This is
to get rid of the error:

: [Vue warn]: You are using the runtime-only build of Vue where the template compiler is not available.
: Either pre-compile the templates into render functions, or use the compiler-included build.

#+begin_src javascript
  vueCompiler: true,
#+end_src

It now works in the index! Time to try and gerbilize it.

