log/0002_Lazy-Dynamic-Module-Init.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-11-25 Wed 11:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lazy Load, Dynamic modules, initialized</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Drew Crampsie" />
</head>
<body>
<div id="content">
<h1 class="title">Lazy Load, Dynamic modules, initialized</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org44f1968">1. Gerbil time</a>
<ul>
<li><a href="#org32e5f38">1.1. Base Example to Gerbil!</a>
<ul>
<li><a href="#FirstVueGx">1.1.1. <code>namespace: vue</code> and <code>vue.js</code>: Our first gerbil component</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd575721">2. Lazy/Dynamic &ldquo;modules&rdquo;</a></li>
<li><a href="#RegisterJumpOnTrampoline">3. <code>g_module_register</code>, it&rsquo;s time we broke up.</a></li>
<li><a href="#org83d348d">4. <code>gxjs-rt.ss</code>, it&rsquo;s time we broke (you) up as well.</a>
<ul>
<li><a href="#orgca426d8">4.1. Minimal &ldquo;Hello&rdquo; attempt.</a></li>
<li><a href="#org5be735d">4.2. Small RT</a></li>
<li><a href="#org85a14e1">4.3. Small FFI</a></li>
<li><a href="#orgc138955">4.4. Separate Lazy Hello</a></li>
<li><a href="#org56c6af8">4.5. <i>File</i> <code>gxjs-init.ss</code></a></li>
<li><a href="#gxjsbsrt">4.6. <code>gxjs-rt</code>, now a minimal BS (bootstrap, not bovine feces) file.</a>
<ul>
<li><a href="#orgc38a3cb">4.6.1. <code>error</code></a></li>
<li><a href="#org1099071">4.6.2. <code>length</code></a></li>
<li><a href="#org55004f3">4.6.3. <code>list-&gt;vector</code></a></li>
<li><a href="#org79b7731">4.6.4. <code>string-append</code></a></li>
<li><a href="#org24ba4db">4.6.5. <i>File</i> <code>gxjs-rt.ss</code></a></li>
</ul>
</li>
<li><a href="#gxjsffi">4.7. <code>gxjs-ffi</code></a>
<ul>
<li><a href="#org1c9fe92">4.7.1. <i>File</i> <code>gxjs-ffi.ss</code></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org6baee68">5. Putting it all together</a>
<ul>
<li><a href="#org2552d88">5.1. Build <code>gxjs</code></a></li>
<li><a href="#org111bce6">5.2. Build the modules</a>
<ul>
<li><a href="#org673bfba">5.2.1. <code>gambit-module-test.ss</code>: A module not loaded in the gambit program</a></li>
</ul>
</li>
<li><a href="#org3d14289">5.3. Now the full gambit repl</a></li>
</ul>
</li>
<li><a href="#org0754ef4">6. Boot File</a></li>
<li><a href="#org2ecae73">7. <code>LogIndex.vue</code>, a logs component</a></li>
<li><a href="#org8134045">8. <code>Index.vue</code></a></li>
<li><a href="#orga22c67e">9. <code>MainLayout.vue</code>: Hello links please!</a></li>
<li><a href="#orge4eb921">10. <code>build.sh</code>: A simple build script</a></li>
<li><a href="#org31b4625">11. Commit, build, commit, deploy</a></li>
</ul>
</div>
</div>
<p>
So far there is just a start at the API and FFI in the RT. Here&rsquo;s a lot more.
</p>

<div id="outline-container-org44f1968" class="outline-2">
<h2 id="org44f1968"><span class="section-number-2">1</span> Gerbil time</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>Quasar</b> uses <b>Vue.js</b> components<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> and I&rsquo;ve really come to like that
approach.
</p>

<p>
Creating a <code>component</code> in <b>Gerbil</b> is the first step.
</p>
</div>

<div id="outline-container-org32e5f38" class="outline-3">
<h3 id="org32e5f38"><span class="section-number-3">1.1</span> Base Example to Gerbil!</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The first example looks like this.
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #5B6268;">// </span><span style="color: #5B6268;">Define a new component called button-counter</span>
Vue.component(<span style="color: #98be65;">'button-counter'</span>, {
  <span style="color: #c678dd;">data</span>: <span style="color: #51afef;">function</span> () {
    <span style="color: #51afef;">return</span> {
      count: <span style="color: #da8548; font-weight: bold;">0</span>
    }
  },
  template: <span style="color: #98be65;">'&lt;button v-on:click="count++"&gt;You clicked me {{ count }} times.&lt;/button&gt;'</span>
})
</pre>
</div>

<p>
I want to make it sexp.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(vue<span style="color: #c678dd;">#</span>component
 <span style="color: #c678dd;">name:</span> <span style="color: #98be65;">"button-counter"</span>
 <span style="color: #c678dd;">data:</span> <span style="color: #dcaeea;">[</span><span style="color: #c678dd;">count:</span> 0<span style="color: #dcaeea;">]</span>
 <span style="color: #c678dd;">template:</span> <span style="color: #51afef;">'</span><span style="color: #98be65;">|&lt;button v-on:click="count++"&gt;You clicked me {{ count }} times.&lt;/button&gt;|</span>)
</pre>
</div>

<p>
We&rsquo;ll make a standalone component and import it to <b>Quasar</b>
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #51afef;">export</span> <span style="color: #51afef;">default</span> {
  name: <span style="color: #98be65;">'ButtonCounter'</span>,
  <span style="color: #c678dd;">data</span>: <span style="color: #51afef;">function</span> () {
    <span style="color: #51afef;">return</span> {
      count: <span style="color: #da8548; font-weight: bold;">0</span>
    }
  },
  template: <span style="color: #98be65;">'&lt;button v-on:click="count++"&gt;JS:You clicked me {{ count }} times.&lt;/button&gt;'</span>
}

</pre>
</div>

<p>
We&rsquo;ll make the template form <code>&lt;js-button-counter&gt;&lt;/js-button-counter&gt;</code>. <b>Vue.js</b>
has &ldquo;Local Registration&rdquo;<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>. The <code>name:</code> matters not and we&rsquo;re not using
<code>Vue.component(&lt;name&gt;, ...)</code> but rather &ldquo;ES2015 modules, such as through [&#x2026;]
Webpack&rdquo;
</p>

<p>
So, import the default with a very specific name.
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #51afef;">import</span> jsButtonCounter from <span style="color: #98be65;">'app/public/test-js-component.js'</span>
</pre>
</div>

<p>
Now in the component itself there&rsquo;s a field to import. And &ldquo;For each property in
the components object, the key will be the name of the custom element, while the
value will contain the options object for the component.&rdquo;<sup><a id="fnr.2.100" class="footref" href="#fn.2">2</a></sup>
</p>

<div class="org-src-container">
<pre class="src src-javascript">  components: { jsButtonCounter },
</pre>
</div>

<p>
Wait, no key? &ldquo;in ES2015+, placing a variable name like ComponentA inside an object is shorthand for ComponentA: ComponentA&rdquo;<sup><a id="fnr.2.100" class="footref" href="#fn.2">2</a></sup>.
</p>

<p>
Ok, but I want <code>&lt;js-button-counter&gt;</code> in kebab-case, do I need a key?
</p>

<p>
&ldquo;When defining a component with PascalCase, you can use either case when
referencing its custom element. That means both <code>&lt;my-component-name&gt;</code> and
<code>&lt;MyComponentName&gt;</code> are acceptable.&rdquo;<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>
</p>

<p>
Yay! Adding the tag to our index and it &#x2026; fails to build.
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #c678dd;">js-button-counter</span>&gt;&lt;/<span style="color: #c678dd;">js-button-counter</span>&gt;
</pre>
</div>

<p>
I had to add the compiler to the <code>build:</code> property in <code>quasar.conf.js</code>. This is
to get rid of the error:
</p>

<pre class="example">
[Vue warn]: You are using the runtime-only build of Vue where the template compiler is not available.
Either pre-compile the templates into render functions, or use the compiler-included build.
</pre>


<div class="org-src-container">
<pre class="src src-javascript">  vueCompiler: <span style="color: #a9a1e1;">true</span>,
</pre>
</div>

<p>
It now works in the index! Time to try and gerbilize it.
</p>
</div>
