doc/log/0002_Lazy-Dynamic-Module-Init.org
*** ~namespace: vue~ and ~vue.js~: Our first gerbil component
:PROPERTIES:
:CUSTOM_ID: FirstVueGx
:END:

#+begin_src scheme :tangle ../../gx/vue.ss
namespace: vue

(def (component . plist)
  (def rlist [])
  (let loop ((pl plist))
    (if (not (null? pl))
      (let ((key (car pl))
            (val (cadr pl))
            (rst (cddr pl)))
        (cond ((eq? data: key)
               (set! val (let ((v (js#js->foreign (js#plist->jso val))))
                            v)))
              ((and (eq? template: key) (##symbol? val))
               (set! val (##symbol->string val))))
        (set! rlist (cons key (cons val rlist)))
        (loop rst))))
  (let ((jso (js#plist->jso rlist)))
    (##inline-host-expression "comp = (@1@); const data = comp.data;
         comp.data = function () { return data } ; comp;" jso)))

(##inline-host-statement
 "exports.ButtonCounter = (@1@);"
 (component
  name: "button-counter"
  data: [ count: 0 ]
  template: '|<button v-on:click="count++"> Gerbil!! You clicked me {{ count }} times.</button>|))
#+end_src

Adding that compiled JS to our runtime and adding the component to our Index works wonders.

#+begin_src html
   <button-counter></button-counter>
#+end_src
#+begin_src javascript
import { Hello, ButtonCounter } from 'app/public/gxjs.js'
// [...]
export default {
 // [...]
  components: { ButtonCounter, jsButtonCounter },
 // [...]
 }
#+end_src

The issue is that it needs to be added to the main file, as does a lot right
now. This has almost everything to do with how *Gambit* initializes the file
according to its module system.

We'll "fix" that for our nefarious purposes.

