log/0002_Lazy-Dynamic-Module-Init.html

<div id="outline-container-FirstVueGx" class="outline-4">
<h4 id="FirstVueGx"><span class="section-number-4">1.1.1</span> <code>namespace: vue</code> and <code>vue.js</code>: Our first gerbil component</h4>
<div class="outline-text-4" id="text-FirstVueGx">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #c678dd;">namespace:</span> vue

(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">component</span> . plist)
  (<span style="color: #51afef;">def</span> <span style="color: #c678dd;">rlist</span> <span style="color: #dcaeea;">[]</span>)
  (<span style="color: #51afef;">let</span> <span style="color: #c678dd;">loop</span> ((pl plist))
    (<span style="color: #51afef;">if</span> (<span style="color: #51afef;">not</span> (null? pl))
      (<span style="color: #51afef;">let</span> ((key (car pl))
            (val (cadr pl))
            (rst (cddr pl)))
        (<span style="color: #51afef;">cond</span> ((eq? <span style="color: #c678dd;">data:</span> key)
               (<span style="color: #51afef;">set!</span> val (<span style="color: #51afef;">let</span> ((v (js<span style="color: #c678dd;">#</span>js-&gt;foreign (js<span style="color: #c678dd;">#</span>plist-&gt;jso val))))
                            v)))
              ((<span style="color: #51afef;">and</span> (eq? <span style="color: #c678dd;">template:</span> key) (<span style="color: #c678dd;">##</span>symbol? val))
               (<span style="color: #51afef;">set!</span> val (<span style="color: #c678dd;">##</span>symbol-&gt;string val))))
        (<span style="color: #51afef;">set!</span> rlist (cons key (cons val rlist)))
        (loop rst))))
  (<span style="color: #51afef;">let</span> ((jso (js<span style="color: #c678dd;">#</span>plist-&gt;jso rlist)))
    (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"comp = (@1@); const data = comp.data;</span>
<span style="color: #98be65;">         comp.data = function () { return data } ; comp;"</span> jso)))

(<span style="color: #c678dd;">##</span>inline-host-statement
 <span style="color: #98be65;">"exports.ButtonCounter = (@1@);"</span>
 (component
  <span style="color: #c678dd;">name:</span> <span style="color: #98be65;">"button-counter"</span>
  <span style="color: #c678dd;">data:</span> <span style="color: #dcaeea;">[</span> <span style="color: #c678dd;">count:</span> 0 <span style="color: #dcaeea;">]</span>
  <span style="color: #c678dd;">template:</span> <span style="color: #51afef;">'</span><span style="color: #98be65;">|&lt;button v-on:click="count++"&gt; Gerbil!! You clicked me {{ count }} times.&lt;/button&gt;|</span>))
</pre>
</div>

<p>
Adding that compiled JS to our runtime and adding the component to our Index works wonders.
</p>

<div class="org-src-container">
<pre class="src src-html">   &lt;<span style="color: #c678dd;">button-counter</span>&gt;&lt;/<span style="color: #c678dd;">button-counter</span>&gt;
</pre>
</div>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #51afef;">import</span> { Hello, ButtonCounter } from <span style="color: #98be65;">'app/public/gxjs.js'</span>
<span style="color: #5B6268;">// </span><span style="color: #5B6268;">[...]</span>
<span style="color: #51afef;">export</span> <span style="color: #51afef;">default</span> {
 <span style="color: #5B6268;">// </span><span style="color: #5B6268;">[...]</span>
  components: { ButtonCounter, jsButtonCounter },
 <span style="color: #5B6268;">// </span><span style="color: #5B6268;">[...]</span>
 }
</pre>
</div>

<p>
The issue is that it needs to be added to the main file, as does a lot right
now. This has almost everything to do with how <b>Gambit</b> initializes the file
according to its module system.
</p>

<p>
We&rsquo;ll &ldquo;fix&rdquo; that for our nefarious purposes.
</p>
</div>
</div>
</div>
</div>
