doc/log/0002_Lazy-Dynamic-Module-Init.org
* Lazy/Dynamic "modules"

I want to have a component JS that is just the component.

#+begin_src scheme :tangle ../../gx/button-counter1.ss
(##inline-host-declaration "console.log('declare lzy button');")
(##inline-host-statement
 "exports.lazyButtonCounter = (@1@);
   alert('lazy button!!');"
(vue#component
  name: "button-counter"
  data: [ count: 0 ]
  template: '|<button v-on:click="count++"> LAZYYY!!!! You clicked me {{ count }} times.</button>|))
#+end_src

Here's the thing. The ~##inline-host-declaration~ becomes a toplevel statement
in the file, so it is run at load time.

But, because both ~##inline-host-statement~ and ~##inline-host-expression~
require scheme-y things that may not exist at load time, they are placed in a
function, a scheme function, that is run when that "gambit module" is
initialized.

Compile it and make it a part of the ~Index.vue~. It fails.

#+begin_src shell
_gxc () {
    _givr="gxc -d . -S -static $1"
 echo "--- Compiling $_givr"; $_givr || exit 1 ; echo;
}
_gxc button-counter.ss
gsc -target js -o button-counter.js static/button-counter.scm

cp button-counter.js ../public/
#+end_src

#+begin_src html
   <lazy-button-counter></lazy-button-counter>
#+end_src
#+begin_src javascript
import { lazyButtonCounter } from 'app/public/button-counter.js'
  components: { ButtonCounter, jsButtonCounter, lazyButtonCounter },
#+end_src

If you notice, we put an alert in that runs when it is initialized. It currently
does not run. That means our attempt at initiailzing things outside of gambit's
~g_module_register~ does not actually work.

If we actually reset the registry, like we did for the gambit repl, it does
work!

#+begin_src shell
_scm_file=static/button-counter.scm;
_fn=$(basename $_scm_file .scm);
_lnk='REMOVE_'$_fn'_.js'
_base='_base_'$_fn'_.js'
_js=$_fn.js

echo This link file has the right g_module_registry_init
gsc -target js -o $_lnk -link -l gxjs-rt $_scm_file || exit 3
_mod_init="$(grep -rE '^g_module_registry_init\(' $_lnk)"
echo $_mod_init

echo  We need to re-register the gxjs-rt
_gxjs_mod_reg="$(grep -rE '^g_module_register\(' gxjs-rt.js)"
echo $_gxjs_mod_reg

echo "moving the inital js"
_mv="mv $_js $_base"; echo $_mv ; $_mv

echo "Resetting module registry"
echo "g_module_count = 0; g_module_map = {}; g_module_table = null; g_module_latest_registered = null; " | tee $_js

echo "Deleting the program description"
echo "delete g_glo['##program-descr']" | tee -a $_js

echo "Adding the new module registry init"
echo $_mod_init | tee -a $_js

echo "Appending the basic code"
cat $_base >> $_js;

echo "Registering the run time which will initilize the new code"
echo $_gxjs_mod_reg | tee -a $_js;

echo "$_js is now completed."
rm $_base; cp button-counter.js ../public/
#+end_src

That means that the registration does what we try to do. We'll just steal it.

