log/0002_Lazy-Dynamic-Module-Init.html

<div id="outline-container-orgd575721" class="outline-2">
<h2 id="orgd575721"><span class="section-number-2">2</span> Lazy/Dynamic &ldquo;modules&rdquo;</h2>
<div class="outline-text-2" id="text-2">
<p>
I want to have a component JS that is just the component.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #c678dd;">##</span>inline-host-declaration <span style="color: #98be65;">"console.log('declare lzy button');"</span>)
(<span style="color: #c678dd;">##</span>inline-host-statement
 <span style="color: #98be65;">"exports.lazyButtonCounter = (@1@);</span>
<span style="color: #98be65;">   alert('lazy button!!');"</span>
(vue<span style="color: #c678dd;">#</span>component
  <span style="color: #c678dd;">name:</span> <span style="color: #98be65;">"button-counter"</span>
  <span style="color: #c678dd;">data:</span> <span style="color: #dcaeea;">[</span> <span style="color: #c678dd;">count:</span> 0 <span style="color: #dcaeea;">]</span>
  <span style="color: #c678dd;">template:</span> <span style="color: #51afef;">'</span><span style="color: #98be65;">|&lt;button v-on:click="count++"&gt; LAZYYY!!!! You clicked me {{ count }} times.&lt;/button&gt;|</span>))
</pre>
</div>

<p>
Here&rsquo;s the thing. The <code>##inline-host-declaration</code> becomes a toplevel statement
in the file, so it is run at load time.
</p>

<p>
But, because both <code>##inline-host-statement</code> and <code>##inline-host-expression</code>
require scheme-y things that may not exist at load time, they are placed in a
function, a scheme function, that is run when that &ldquo;gambit module&rdquo; is
initialized.
</p>

<p>
Compile it and make it a part of the <code>Index.vue</code>. It fails.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #c678dd;">_gxc</span> <span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #dcaeea;">_givr</span>=<span style="color: #98be65;">"gxc -d . -S -static </span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">1</span><span style="color: #98be65;">"</span>
 <span style="color: #ECBE7B;">echo</span> <span style="color: #98be65;">"--- Compiling $_givr"</span>; $<span style="color: #dcaeea;">_givr</span> || <span style="color: #51afef;">exit</span> <span style="color: #da8548; font-weight: bold;">1</span> ; <span style="color: #ECBE7B;">echo</span>;
<span style="color: #51afef;">}</span>
_gxc button-counter.ss
gsc -target js -o button-counter.js static/button-counter.scm

<span style="color: #ECBE7B;">cp</span> button-counter.js ../public/
</pre>
</div>

<div class="org-src-container">
<pre class="src src-html">   &lt;<span style="color: #c678dd;">lazy-button-counter</span>&gt;&lt;/<span style="color: #c678dd;">lazy-button-counter</span>&gt;
</pre>
</div>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #51afef;">import</span> { lazyButtonCounter } from <span style="color: #98be65;">'app/public/button-counter.js'</span>
  components: { ButtonCounter, jsButtonCounter, lazyButtonCounter },
</pre>
</div>

<p>
If you notice, we put an alert in that runs when it is initialized. It currently
does not run. That means our attempt at initiailzing things outside of gambit&rsquo;s
<code>g_module_register</code> does not actually work.
</p>

<p>
If we actually reset the registry, like we did for the gambit repl, it does
work!
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #dcaeea;">_scm_file</span>=static/button-counter.scm;
<span style="color: #dcaeea;">_fn</span>=$<span style="color: #51afef;">(</span><span style="color: #51afef; font-weight: bold;">basename</span> $<span style="color: #dcaeea;">_scm_file</span> .scm<span style="color: #51afef;">)</span>;
<span style="color: #dcaeea;">_lnk</span>=<span style="color: #98be65;">'REMOVE_'</span>$<span style="color: #dcaeea;">_fn</span><span style="color: #98be65;">'_.js'</span>
<span style="color: #dcaeea;">_base</span>=<span style="color: #98be65;">'_base_'</span>$<span style="color: #dcaeea;">_fn</span><span style="color: #98be65;">'_.js'</span>
<span style="color: #dcaeea;">_js</span>=$<span style="color: #dcaeea;">_fn</span>.js

<span style="color: #ECBE7B;">echo</span> This link file has the right g_module_registry_init
gsc -target js -o $<span style="color: #dcaeea;">_lnk</span> -link -l gxjs-rt $<span style="color: #dcaeea;">_scm_file</span> || <span style="color: #51afef;">exit</span> <span style="color: #da8548; font-weight: bold;">3</span>
<span style="color: #dcaeea;">_mod_init</span>=<span style="color: #98be65;">"</span><span style="color: #51afef; font-weight: bold;">$(</span><span style="color: #51afef; font-weight: bold;">grep</span><span style="color: #51afef; font-weight: bold;"> -rE '^g_module_registry_init\(' $_lnk)</span><span style="color: #98be65;">"</span>
<span style="color: #ECBE7B;">echo</span> $<span style="color: #dcaeea;">_mod_init</span>

<span style="color: #ECBE7B;">echo</span>  We need to re-register the gxjs-rt
<span style="color: #dcaeea;">_gxjs_mod_reg</span>=<span style="color: #98be65;">"</span><span style="color: #51afef; font-weight: bold;">$(</span><span style="color: #51afef; font-weight: bold;">grep</span><span style="color: #51afef; font-weight: bold;"> -rE '^g_module_register\(' gxjs-rt.js)</span><span style="color: #98be65;">"</span>
<span style="color: #ECBE7B;">echo</span> $<span style="color: #dcaeea;">_gxjs_mod_reg</span>

<span style="color: #ECBE7B;">echo</span> <span style="color: #98be65;">"moving the inital js"</span>
<span style="color: #dcaeea;">_mv</span>=<span style="color: #98be65;">"</span><span style="color: #98be65;">mv</span><span style="color: #98be65;"> $_js $_base"</span>; <span style="color: #ECBE7B;">echo</span> $<span style="color: #dcaeea;">_mv</span> ; $<span style="color: #dcaeea;">_mv</span>

<span style="color: #ECBE7B;">echo</span> <span style="color: #98be65;">"Resetting module registry"</span>
<span style="color: #ECBE7B;">echo</span> <span style="color: #98be65;">"g_module_count = 0; g_module_map = {}; g_module_table = null; g_module_latest_registered = null; "</span> | tee $<span style="color: #dcaeea;">_js</span>

<span style="color: #ECBE7B;">echo</span> <span style="color: #98be65;">"Deleting the program description"</span>
<span style="color: #ECBE7B;">echo</span> <span style="color: #98be65;">"delete g_glo['##program-descr']"</span> | tee -a $<span style="color: #dcaeea;">_js</span>

<span style="color: #ECBE7B;">echo</span> <span style="color: #98be65;">"Adding the new module registry init"</span>
<span style="color: #ECBE7B;">echo</span> $<span style="color: #dcaeea;">_mod_init</span> | tee -a $<span style="color: #dcaeea;">_js</span>

<span style="color: #ECBE7B;">echo</span> <span style="color: #98be65;">"Appending the basic code"</span>
<span style="color: #ECBE7B;">cat</span> $<span style="color: #dcaeea;">_base</span> &gt;&gt; $<span style="color: #dcaeea;">_js</span>;

<span style="color: #ECBE7B;">echo</span> <span style="color: #98be65;">"Registering the run time which will initilize the new code"</span>
<span style="color: #ECBE7B;">echo</span> $<span style="color: #dcaeea;">_gxjs_mod_reg</span> | tee -a $<span style="color: #dcaeea;">_js</span>;

<span style="color: #ECBE7B;">echo</span> <span style="color: #98be65;">"$_js is now completed."</span>
<span style="color: #ECBE7B;">rm</span> $<span style="color: #dcaeea;">_base</span>; <span style="color: #ECBE7B;">cp</span> button-counter.js ../public/
</pre>
</div>

<p>
That means that the registration does what we try to do. We&rsquo;ll just steal it.
</p>
</div>
</div>
