doc/log/0002_Lazy-Dynamic-Module-Init.org
* ~g_module_register~, it's time we broke up.
:PROPERTIES:
:CUSTOM_ID: RegisterJumpOnTrampoline
:END:

#+begin_src javascript :noweb-ref g_module_register

g_module_name = function (module_descr) {
  var temp = module_descr[0];
  var name = temp[temp.length - 1].name;
  return name;
};

g_module_init = function(module_descr) {
  g_sp = -1;
  g_stack[++g_sp] = void 0;
  g_r0 = g_underflow;
  g_nargs = 0;
  g_trampoline(module_descr[4]);
};

gx_gambit_module_table = (typeof gx_old_module_register === 'undefined') ? [] : gx_gambit_module_table;

g_module_register = function (module_descr) {
  // Keep track of all registered modules.
  gx_gambit_module_table.push(module_descr);

  if ( typeof g_glo['##program-descr'] === 'object' ) {
    g_module_init(module_descr);
  } else {
    var temp = module_descr[0];
    var name = temp[temp.length - 1].name;
    var info = Object.prototype.hasOwnProperty.call(g_module_map,name) ? g_module_map[name] : null;
    g_module_latest_registered = module_descr;
    if (!(info === null || g_module_count === g_module_table.length)) {
      var index = info.index;
      var old = g_module_table[index];
      g_module_table[index] = module_descr;
      if (old === null) {
        ++g_module_count;
        if (g_module_count === g_module_table.length) {
          g_glo["##program-descr"] = [g_module_table,null,false];
          temp = g_module_table[g_module_table.length - 1][0];
          g_glo["##vm-main-module-ref"] = temp[temp.length - 1];
          g_sp = -1;
          g_stack[++g_sp] = void 0;
          g_r0 = g_underflow;
          g_nargs = 0;
          g_trampoline(g_module_table[0][4]);
        }
      }
    }
  }
};

#+end_src

#+begin_src scheme :tangle ../../gx/button-counter.ss :noweb yes
(##inline-host-declaration "console.log('declare lazy init!!!! button');")
(##inline-host-declaration #<<HOSTDECL
 {%g_module_register%}
HOSTDECL
)

(##inline-host-statement
 "exports.lazyButtonCounter = (@1@);
   console.log('lazy init!! button!!');"
(vue#component
  name: "button-counter"
  data: [ count: 0 ]
  template: '|<button v-on:click="count++"> LAZYYY!!!! You clicked me {{ count }} times.</button>|))
#+end_src


That actually works great, so it's time to make our run time that uses that technique.


