log/0002_Lazy-Dynamic-Module-Init.html

<div id="outline-container-RegisterJumpOnTrampoline" class="outline-2">
<h2 id="RegisterJumpOnTrampoline"><span class="section-number-2">3</span> <code>g_module_register</code>, it&rsquo;s time we broke up.</h2>
<div class="outline-text-2" id="text-RegisterJumpOnTrampoline">
<div class="org-src-container">
<pre class="src src-javascript">
g_module_name = <span style="color: #51afef;">function</span> (<span style="color: #dcaeea;">module_descr</span>) {
  <span style="color: #51afef;">var</span> <span style="color: #dcaeea;">temp</span> = module_descr[<span style="color: #da8548; font-weight: bold;">0</span>];
  <span style="color: #51afef;">var</span> <span style="color: #dcaeea;">name</span> = temp[temp.length - <span style="color: #da8548; font-weight: bold;">1</span>].name;
  <span style="color: #51afef;">return</span> name;
};

g_module_init = <span style="color: #51afef;">function</span>(<span style="color: #dcaeea;">module_descr</span>) {
  g_sp = -<span style="color: #da8548; font-weight: bold;">1</span>;
  g_stack[++g_sp] = <span style="color: #51afef;">void</span> <span style="color: #da8548; font-weight: bold;">0</span>;
  g_r0 = g_underflow;
  g_nargs = <span style="color: #da8548; font-weight: bold;">0</span>;
  g_trampoline(module_descr[<span style="color: #da8548; font-weight: bold;">4</span>]);
};

gx_gambit_module_table = (<span style="color: #51afef;">typeof</span> gx_old_module_register === <span style="color: #98be65;">'undefined'</span>) ? [] : gx_gambit_module_table;

g_module_register = <span style="color: #51afef;">function</span> (<span style="color: #dcaeea;">module_descr</span>) {
  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Keep track of all registered modules.</span>
  gx_gambit_module_table.push(module_descr);

  <span style="color: #51afef;">if</span> ( <span style="color: #51afef;">typeof</span> g_glo[<span style="color: #98be65;">'##program-descr'</span>] === <span style="color: #98be65;">'object'</span> ) {
    g_module_init(module_descr);
  } <span style="color: #51afef;">else</span> {
    <span style="color: #51afef;">var</span> <span style="color: #dcaeea;">temp</span> = module_descr[<span style="color: #da8548; font-weight: bold;">0</span>];
    <span style="color: #51afef;">var</span> <span style="color: #dcaeea;">name</span> = temp[temp.length - <span style="color: #da8548; font-weight: bold;">1</span>].name;
    <span style="color: #51afef;">var</span> <span style="color: #dcaeea;">info</span> = Object.<span style="color: #a9a1e1;">prototype</span>.hasOwnProperty.call(g_module_map,name) ? g_module_map[name] : <span style="color: #a9a1e1;">null</span>;
    g_module_latest_registered = module_descr;
    <span style="color: #51afef;">if</span> (!(info === <span style="color: #a9a1e1;">null</span> || g_module_count === g_module_table.length)) {
      <span style="color: #51afef;">var</span> <span style="color: #dcaeea;">index</span> = info.index;
      <span style="color: #51afef;">var</span> <span style="color: #dcaeea;">old</span> = g_module_table[index];
      g_module_table[index] = module_descr;
      <span style="color: #51afef;">if</span> (old === <span style="color: #a9a1e1;">null</span>) {
        ++g_module_count;
        <span style="color: #51afef;">if</span> (g_module_count === g_module_table.length) {
          g_glo[<span style="color: #98be65;">"##program-descr"</span>] = [g_module_table,<span style="color: #a9a1e1;">null</span>,<span style="color: #a9a1e1;">false</span>];
          temp = g_module_table[g_module_table.length - <span style="color: #da8548; font-weight: bold;">1</span>][<span style="color: #da8548; font-weight: bold;">0</span>];
          g_glo[<span style="color: #98be65;">"##vm-main-module-ref"</span>] = temp[temp.length - <span style="color: #da8548; font-weight: bold;">1</span>];
          g_sp = -<span style="color: #da8548; font-weight: bold;">1</span>;
          g_stack[++g_sp] = <span style="color: #51afef;">void</span> <span style="color: #da8548; font-weight: bold;">0</span>;
          g_r0 = g_underflow;
          g_nargs = <span style="color: #da8548; font-weight: bold;">0</span>;
          g_trampoline(g_module_table[<span style="color: #da8548; font-weight: bold;">0</span>][<span style="color: #da8548; font-weight: bold;">4</span>]);
        }
      }
    }
  }
};

</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #c678dd;">##</span>inline-host-declaration <span style="color: #98be65;">"console.log('declare lazy init!!!! button');"</span>)
(<span style="color: #c678dd;">##</span>inline-host-declaration <span style="color: #c678dd;">#</span>&lt;&lt;HOSTDECL

 g<span style="color: #c678dd;">_</span>module<span style="color: #c678dd;">_</span>name = function (module<span style="color: #c678dd;">_</span>descr) <span style="color: #dcaeea;">{</span>
   var temp = module<span style="color: #c678dd;">_</span>descr<span style="color: #dcaeea;">[</span>0<span style="color: #dcaeea;">]</span><span style="color: #5B6268;">;</span>
   var name = temp<span style="color: #dcaeea;">[</span>temp.length - 1<span style="color: #dcaeea;">]</span>.name<span style="color: #5B6268;">;</span>
   return name<span style="color: #5B6268;">;</span>
 <span style="color: #dcaeea;">}</span><span style="color: #5B6268;">;</span>

 g<span style="color: #c678dd;">_</span>module<span style="color: #c678dd;">_</span>init = function(module<span style="color: #c678dd;">_</span>descr) <span style="color: #dcaeea;">{</span>
   g<span style="color: #c678dd;">_</span>sp = -1<span style="color: #5B6268;">;</span>
   g<span style="color: #c678dd;">_</span>stack<span style="color: #dcaeea;">[</span>++g<span style="color: #c678dd;">_</span>sp<span style="color: #dcaeea;">]</span> = void 0<span style="color: #5B6268;">;</span>
   g<span style="color: #c678dd;">_</span>r0 = g<span style="color: #c678dd;">_</span>underflow<span style="color: #5B6268;">;</span>
   g<span style="color: #c678dd;">_</span>nargs = 0<span style="color: #5B6268;">;</span>
   g<span style="color: #c678dd;">_</span>trampoline(module<span style="color: #c678dd;">_</span>descr<span style="color: #dcaeea;">[</span>4<span style="color: #dcaeea;">]</span>)<span style="color: #5B6268;">;</span>
 <span style="color: #dcaeea;">}</span><span style="color: #5B6268;">;</span>

 gx<span style="color: #c678dd;">_</span>gambit<span style="color: #c678dd;">_</span>module<span style="color: #c678dd;">_</span>table = (typeof gx<span style="color: #c678dd;">_</span>old<span style="color: #c678dd;">_</span>module<span style="color: #c678dd;">_</span>register === <span style="color: #51afef;">'</span>undefined<span style="color: #51afef;">'</span>) <span style="color: #c678dd;">?</span> <span style="color: #dcaeea;">[]</span> : gx<span style="color: #c678dd;">_</span>gambit<span style="color: #c678dd;">_</span>module<span style="color: #c678dd;">_</span>table<span style="color: #5B6268;">;</span>

 g<span style="color: #c678dd;">_</span>module<span style="color: #c678dd;">_</span>register = function (module<span style="color: #c678dd;">_</span>descr) <span style="color: #dcaeea;">{</span>
   // Keep track of all registered modules.
   gx<span style="color: #c678dd;">_</span>gambit<span style="color: #c678dd;">_</span>module<span style="color: #c678dd;">_</span>table.push(module<span style="color: #c678dd;">_</span>descr)<span style="color: #5B6268;">;</span>

   if ( typeof g<span style="color: #c678dd;">_</span>glo<span style="color: #dcaeea;">[</span><span style="color: #51afef;">'</span><span style="color: #c678dd;">##</span>program-descr<span style="color: #51afef;">'</span><span style="color: #dcaeea;">]</span> === <span style="color: #51afef;">'</span>object<span style="color: #51afef;">'</span> ) <span style="color: #dcaeea;">{</span>
     g<span style="color: #c678dd;">_</span>module<span style="color: #c678dd;">_</span>init(module<span style="color: #c678dd;">_</span>descr)<span style="color: #5B6268;">;</span>
   <span style="color: #dcaeea;">}</span> else <span style="color: #dcaeea;">{</span>
     var temp = module<span style="color: #c678dd;">_</span>descr<span style="color: #dcaeea;">[</span>0<span style="color: #dcaeea;">]</span><span style="color: #5B6268;">;</span>
     var name = temp<span style="color: #dcaeea;">[</span>temp.length - 1<span style="color: #dcaeea;">]</span>.name<span style="color: #5B6268;">;</span>
     var info = Object.prototype.hasOwnProperty.call(g<span style="color: #c678dd;">_</span>module<span style="color: #c678dd;">_</span>map<span style="color: #51afef;">,</span>name) <span style="color: #c678dd;">?</span> g<span style="color: #c678dd;">_</span>module<span style="color: #c678dd;">_</span>map<span style="color: #dcaeea;">[</span>name<span style="color: #dcaeea;">]</span> : null<span style="color: #5B6268;">;</span>
     g<span style="color: #c678dd;">_</span>module<span style="color: #c678dd;">_</span>latest<span style="color: #c678dd;">_</span>registered = module<span style="color: #c678dd;">_</span>descr<span style="color: #5B6268;">;</span>
     if (<span style="color: #c678dd;">!</span>(info === null <span style="color: #98be65;">||</span> g<span style="color: #c678dd;">_</span>module<span style="color: #c678dd;">_</span>count === g<span style="color: #c678dd;">_</span>module<span style="color: #c678dd;">_</span>table.length)) <span style="color: #dcaeea;">{</span>
       var index = info.index<span style="color: #5B6268;">;</span>
       var old = g<span style="color: #c678dd;">_</span>module<span style="color: #c678dd;">_</span>table<span style="color: #dcaeea;">[</span>index<span style="color: #dcaeea;">]</span><span style="color: #5B6268;">;</span>
       g<span style="color: #c678dd;">_</span>module<span style="color: #c678dd;">_</span>table<span style="color: #dcaeea;">[</span>index<span style="color: #dcaeea;">]</span> = module<span style="color: #c678dd;">_</span>descr<span style="color: #5B6268;">;</span>
       if (old === null) <span style="color: #dcaeea;">{</span>
         ++g<span style="color: #c678dd;">_</span>module<span style="color: #c678dd;">_</span>count<span style="color: #5B6268;">;</span>
         if (g<span style="color: #c678dd;">_</span>module<span style="color: #c678dd;">_</span>count === g<span style="color: #c678dd;">_</span>module<span style="color: #c678dd;">_</span>table.length) <span style="color: #dcaeea;">{</span>
           g<span style="color: #c678dd;">_</span>glo<span style="color: #dcaeea;">[</span><span style="color: #98be65;">"##program-descr"</span><span style="color: #dcaeea;">]</span> = <span style="color: #dcaeea;">[</span>g<span style="color: #c678dd;">_</span>module<span style="color: #c678dd;">_</span>table<span style="color: #51afef;">,</span>null<span style="color: #51afef;">,</span>false<span style="color: #dcaeea;">]</span><span style="color: #5B6268;">;</span>
           temp = g<span style="color: #c678dd;">_</span>module<span style="color: #c678dd;">_</span>table<span style="color: #dcaeea;">[</span>g<span style="color: #c678dd;">_</span>module<span style="color: #c678dd;">_</span>table.length - 1<span style="color: #dcaeea;">][</span>0<span style="color: #dcaeea;">]</span><span style="color: #5B6268;">;</span>
           g<span style="color: #c678dd;">_</span>glo<span style="color: #dcaeea;">[</span><span style="color: #98be65;">"##vm-main-module-ref"</span><span style="color: #dcaeea;">]</span> = temp<span style="color: #dcaeea;">[</span>temp.length - 1<span style="color: #dcaeea;">]</span><span style="color: #5B6268;">;</span>
           g<span style="color: #c678dd;">_</span>sp = -1<span style="color: #5B6268;">;</span>
           g<span style="color: #c678dd;">_</span>stack<span style="color: #dcaeea;">[</span>++g<span style="color: #c678dd;">_</span>sp<span style="color: #dcaeea;">]</span> = void 0<span style="color: #5B6268;">;</span>
           g<span style="color: #c678dd;">_</span>r0 = g<span style="color: #c678dd;">_</span>underflow<span style="color: #5B6268;">;</span>
           g<span style="color: #c678dd;">_</span>nargs = 0<span style="color: #5B6268;">;</span>
           g<span style="color: #c678dd;">_</span>trampoline(g<span style="color: #c678dd;">_</span>module<span style="color: #c678dd;">_</span>table<span style="color: #dcaeea;">[</span>0<span style="color: #dcaeea;">][</span>4<span style="color: #dcaeea;">]</span>)<span style="color: #5B6268;">;</span>
         <span style="color: #dcaeea;">}</span>
       <span style="color: #dcaeea;">}</span>
     <span style="color: #dcaeea;">}</span>
   <span style="color: #dcaeea;">}</span>
 <span style="color: #dcaeea;">}</span><span style="color: #5B6268;">;</span>

HOSTDECL
)

(<span style="color: #c678dd;">##</span>inline-host-statement
 <span style="color: #98be65;">"exports.lazyButtonCounter = (@1@);</span>
<span style="color: #98be65;">   console.log('lazy init!! button!!');"</span>
(vue<span style="color: #c678dd;">#</span>component
  <span style="color: #c678dd;">name:</span> <span style="color: #98be65;">"button-counter"</span>
  <span style="color: #c678dd;">data:</span> <span style="color: #dcaeea;">[</span> <span style="color: #c678dd;">count:</span> 0 <span style="color: #dcaeea;">]</span>
  <span style="color: #c678dd;">template:</span> <span style="color: #51afef;">'</span><span style="color: #98be65;">|&lt;button v-on:click="count++"&gt; LAZYYY!!!! You clicked me {{ count }} times.&lt;/button&gt;|</span>))
</pre>
</div>


<p>
That actually works great, so it&rsquo;s time to make our run time that uses that technique.
</p>
</div>
</div>
