doc/log/0002_Lazy-Dynamic-Module-Init.org
*  ~gxjs-rt.ss~, it's time we broke (you) up as well.

We'll make ~gxjs.js~ from three different files: ~gxjs-init.ss~, ~gxjs-rt.ss~
and ~gxjs-ffi.ss~. The first will be minimal, basically just the inititalize
functions. The second will have "all" (aka some) of the forms we need to
bootstrap *Gerbil* in ~js~ (eventually). The third will have the FFI we need to
develop *GxQuasar*.

First things first, we want to avoid needing to ~grep~ and replace them in the
build system. Things need to be KISS'd.

Since we already know how to re-initilize the module registry we'll make it do
so when initiailzing.

#+begin_src javascript :noweb-ref g_module_registry_reset
g_module_registry_reset = function () {
  g_module_count = 0;
  g_module_map = {};
  g_module_table = null;
  g_module_latest_registered = null;
};
#+end_src

#+begin_src javascript :noweb-ref g_module_registry_init
g_module_registry_init = function (link_info) {
  var n = link_info.length;
  var i = 0;
  g_module_registry_reset();
  g_module_table = new Array(n);
  while (i < n) {
    var info = link_info[i];
    g_module_map[info.name] = info;
    g_module_table[i] = null;
    ++i;
  }
};
#+end_src

** Minimal "Hello" attempt.


Now we need to re-init the registry. We know from experience this can come from
compilation.

Back to a hello that does nothing.

#+begin_src scheme :tangle ../../gx/hello1.ss
(##inline-host-statement
 " exports.links = [{title: 'foo', link: 'https://google.ca'}];"
)


(##inline-host-statement
 "exports.Hello = (arg) => {
  alert('Hello ' + arg)
}")
#+end_src

Now a ~js~ file that just has that.
#+begin_src shell
_gxc () {
    _givr="gxc -d . -S -static $1"
 echo "--- Compiling $_givr"; $_givr || exit 1 ; echo;
}
echo "Compile the base -l library gxjs-init.js"

_gxc gxjs-init.ss
gsc  -target js -c -o gxjs-init.js static/gxjs-init.scm || exit 1;

echo "----------------"; echo; echo;

_gxc hello.ss
echo Make a link file from our file to this runtime
gsc -target js -o REMOVE-gxjs_.js -link -l gxjs-init static/hello.scm

echo Steal the registry init
_hello_mod_init="$(grep -rE '^g_module_registry_init\(' REMOVE-gxjs_.js)"

echo Init for registry: $_hello_mod_init;
rm REMOVE-gxjs_.js


# Compile a link file from our hello to the _gambit.js runtime.
gsc -target js -o gxjs-link.js -link static/hello.scm

echo Append replace the module init with the other one for our runtime.

sed -i "s/^g_module_registry_init(.*/$_hello_mod_init/" gxjs-link.js

gsc -target js -o hello.js static/hello.scm

_gxjs_rt='cat gxjs-link.js gxjs-init.js hello.js  > gxjs.js'; echo making exec: $_gxjs_rt; bash -c "$_gxjs_rt";
#+end_src

The ~sed~ gives us a simple init
  : g_module_registry_init([new G_ModLinkInfo("gxjs-init",0),new G_ModLinkInfo("hello",1)]);


If we add that form to the declarations in the ~gxjs-init.ss~, we can get rid of the ~sed~! That means our new attempt is working.

** Small RT

[[#gxjsbsrt][~gxjs-rt~]] is fairly small so lets add it to our hello. We'll use ~##length~.

#+begin_src scheme :tangle ../../gx/hello1.ss
(##inline-host-statement
 " exports.links = [{title: 'foo', link: 'https://google.ca'}];"
)

(##inline-host-statement
 "exports.Hello = (arg) => {
  alert('Hello ' + arg + ' ' + (@1@))
}"
 (##length '(1 2 3)))
#+end_src

Build it.

#+begin_src shell
_gxc () {
    _givr="gxc -d . -S -static $1"
 echo "--- Compiling $_givr"; $_givr || exit 1 ; echo;
}
echo "Compile the base -l library gxjs-init.js"

_gxc gxjs-init.ss
gsc  -target js -c -o gxjs-init.js static/gxjs-init.scm || exit 1;

echo "----------------"; echo; echo;

_gxc hello.ss
_gxc gxjs-rt.ss
echo Make a link file from our file to this runtime
gsc -target js -o REMOVE-gxjs_.js -link -l gxjs-init static/hello.scm static/gxjs-rt.scm

echo Steal the registry init
_hello_mod_init="$(grep -rE '^g_module_registry_init\(' REMOVE-gxjs_.js)"

echo Init for registry: $_hello_mod_init;
rm REMOVE-gxjs_.js

# Compile a link file from our hello to the _gambit.js runtime.
gsc -target js -o gxjs-link.js -link static/hello.scm

echo Append replace the module init with the other one for our runtime.

sed -i "s/^g_module_registry_init(.*/$_hello_mod_init/" gxjs-link.js

gsc -target js -o hello.js static/hello.scm
gsc -target js -o gxjs-rt.js static/gxjs-rt.scm

_gxjs_rt='cat gxjs-link.js gxjs-init.js hello.js gxjs-rt.js > gxjs.js'; echo making exec: $_gxjs_rt; bash -c "$_gxjs_rt";
#+end_src

