log/0002_Lazy-Dynamic-Module-Init.html


<div id="outline-container-org83d348d" class="outline-2">
<h2 id="org83d348d"><span class="section-number-2">4</span> <code>gxjs-rt.ss</code>, it&rsquo;s time we broke (you) up as well.</h2>
<div class="outline-text-2" id="text-4">
<p>
We&rsquo;ll make <code>gxjs.js</code> from three different files: <code>gxjs-init.ss</code>, <code>gxjs-rt.ss</code>
and <code>gxjs-ffi.ss</code>. The first will be minimal, basically just the inititalize
functions. The second will have &ldquo;all&rdquo; (aka some) of the forms we need to
bootstrap <b>Gerbil</b> in <code>js</code> (eventually). The third will have the FFI we need to
develop <b>GxQuasar</b>.
</p>

<p>
First things first, we want to avoid needing to <code>grep</code> and replace them in the
build system. Things need to be KISS&rsquo;d.
</p>

<p>
Since we already know how to re-initilize the module registry we&rsquo;ll make it do
so when initiailzing.
</p>

<div class="org-src-container">
<pre class="src src-javascript">g_module_registry_reset = <span style="color: #51afef;">function</span> () {
  g_module_count = <span style="color: #da8548; font-weight: bold;">0</span>;
  g_module_map = {};
  g_module_table = <span style="color: #a9a1e1;">null</span>;
  g_module_latest_registered = <span style="color: #a9a1e1;">null</span>;
};
</pre>
</div>

<div class="org-src-container">
<pre class="src src-javascript">g_module_registry_init = <span style="color: #51afef;">function</span> (<span style="color: #dcaeea;">link_info</span>) {
  <span style="color: #51afef;">var</span> <span style="color: #dcaeea;">n</span> = link_info.length;
  <span style="color: #51afef;">var</span> <span style="color: #dcaeea;">i</span> = <span style="color: #da8548; font-weight: bold;">0</span>;
  g_module_registry_reset();
  g_module_table = <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">Array</span>(n);
  <span style="color: #51afef;">while</span> (i &lt; n) {
    <span style="color: #51afef;">var</span> <span style="color: #dcaeea;">info</span> = link_info[i];
    g_module_map[info.name] = info;
    g_module_table[i] = <span style="color: #a9a1e1;">null</span>;
    ++i;
  }
};
</pre>
</div>
</div>

<div id="outline-container-orgca426d8" class="outline-3">
<h3 id="orgca426d8"><span class="section-number-3">4.1</span> Minimal &ldquo;Hello&rdquo; attempt.</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Now we need to re-init the registry. We know from experience this can come from
compilation.
</p>

<p>
Back to a hello that does nothing.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #c678dd;">##</span>inline-host-statement
 <span style="color: #98be65;">" exports.links = [{title: 'foo', link: 'https://google.ca'}];"</span>
)


(<span style="color: #c678dd;">##</span>inline-host-statement
 <span style="color: #98be65;">"exports.Hello = (arg) =&gt; {</span>
<span style="color: #98be65;">  alert('Hello ' + arg)</span>
<span style="color: #98be65;">}"</span>)
</pre>
</div>

<p>
Now a <code>js</code> file that just has that.
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #c678dd;">_gxc</span> <span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #dcaeea;">_givr</span>=<span style="color: #98be65;">"gxc -d . -S -static </span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">1</span><span style="color: #98be65;">"</span>
 <span style="color: #ECBE7B;">echo</span> <span style="color: #98be65;">"--- Compiling $_givr"</span>; $<span style="color: #dcaeea;">_givr</span> || <span style="color: #51afef;">exit</span> <span style="color: #da8548; font-weight: bold;">1</span> ; <span style="color: #ECBE7B;">echo</span>;
<span style="color: #51afef;">}</span>
<span style="color: #ECBE7B;">echo</span> <span style="color: #98be65;">"Compile the base -l library gxjs-init.js"</span>

_gxc gxjs-init.ss
gsc  -target js -c -o gxjs-init.js static/gxjs-init.scm || <span style="color: #51afef;">exit</span> <span style="color: #da8548; font-weight: bold;">1</span>;

<span style="color: #ECBE7B;">echo</span> <span style="color: #98be65;">"----------------"</span>; <span style="color: #ECBE7B;">echo</span>; <span style="color: #ECBE7B;">echo</span>;

_gxc hello.ss
<span style="color: #ECBE7B;">echo</span> Make a link file from our file to this runtime
gsc -target js -o REMOVE-gxjs_.js -link -l gxjs-init static/hello.scm

<span style="color: #ECBE7B;">echo</span> Steal the registry init
<span style="color: #dcaeea;">_hello_mod_init</span>=<span style="color: #98be65;">"</span><span style="color: #51afef; font-weight: bold;">$(</span><span style="color: #51afef; font-weight: bold;">grep</span><span style="color: #51afef; font-weight: bold;"> -rE '^g_module_registry_init\(' REMOVE-gxjs_.js)</span><span style="color: #98be65;">"</span>

<span style="color: #ECBE7B;">echo</span> Init for registry: $<span style="color: #dcaeea;">_hello_mod_init</span>;
<span style="color: #ECBE7B;">rm</span> REMOVE-gxjs_.js


<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Compile a link file from our hello to the _gambit.js runtime.</span>
gsc -target js -o gxjs-link.js -link static/hello.scm

<span style="color: #ECBE7B;">echo</span> Append replace the module init with the other one for our runtime.

sed -i <span style="color: #98be65;">"s/^g_module_registry_init(.*/$_hello_mod_init/"</span> gxjs-link.js

gsc -target js -o hello.js static/hello.scm

<span style="color: #dcaeea;">_gxjs_rt</span>=<span style="color: #98be65;">'</span><span style="color: #98be65;">cat</span><span style="color: #98be65;"> gxjs-link.js gxjs-init.js hello.js  &gt; gxjs.js'</span>; <span style="color: #ECBE7B;">echo</span> making exec: $<span style="color: #dcaeea;">_gxjs_rt</span>; bash -c <span style="color: #98be65;">"$_gxjs_rt"</span>;
</pre>
</div>

<p>
The <code>sed</code> gives us a simple init
</p>
<pre class="example">
g_module_registry_init([new G_ModLinkInfo("gxjs-init",0),new G_ModLinkInfo("hello",1)]);
</pre>



<p>
If we add that form to the declarations in the <code>gxjs-init.ss</code>, we can get rid of the <code>sed</code>! That means our new attempt is working.
</p>
</div>
</div>

<div id="outline-container-org5be735d" class="outline-3">
<h3 id="org5be735d"><span class="section-number-3">4.2</span> Small RT</h3>
<div class="outline-text-3" id="text-4-2">
<p>
<a href="#gxjsbsrt"><code>gxjs-rt</code></a> is fairly small so lets add it to our hello. We&rsquo;ll use <code>##length</code>.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #c678dd;">##</span>inline-host-statement
 <span style="color: #98be65;">" exports.links = [{title: 'foo', link: 'https://google.ca'}];"</span>
)

(<span style="color: #c678dd;">##</span>inline-host-statement
 <span style="color: #98be65;">"exports.Hello = (arg) =&gt; {</span>
<span style="color: #98be65;">  alert('Hello ' + arg + ' ' + (@1@))</span>
<span style="color: #98be65;">}"</span>
 (<span style="color: #c678dd;">##</span>length <span style="color: #51afef;">'</span>(1 2 3)))
</pre>
</div>

<p>
Build it.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #c678dd;">_gxc</span> <span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #dcaeea;">_givr</span>=<span style="color: #98be65;">"gxc -d . -S -static </span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">1</span><span style="color: #98be65;">"</span>
 <span style="color: #ECBE7B;">echo</span> <span style="color: #98be65;">"--- Compiling $_givr"</span>; $<span style="color: #dcaeea;">_givr</span> || <span style="color: #51afef;">exit</span> <span style="color: #da8548; font-weight: bold;">1</span> ; <span style="color: #ECBE7B;">echo</span>;
<span style="color: #51afef;">}</span>
<span style="color: #ECBE7B;">echo</span> <span style="color: #98be65;">"Compile the base -l library gxjs-init.js"</span>

_gxc gxjs-init.ss
gsc  -target js -c -o gxjs-init.js static/gxjs-init.scm || <span style="color: #51afef;">exit</span> <span style="color: #da8548; font-weight: bold;">1</span>;

<span style="color: #ECBE7B;">echo</span> <span style="color: #98be65;">"----------------"</span>; <span style="color: #ECBE7B;">echo</span>; <span style="color: #ECBE7B;">echo</span>;

_gxc hello.ss
_gxc gxjs-rt.ss
<span style="color: #ECBE7B;">echo</span> Make a link file from our file to this runtime
gsc -target js -o REMOVE-gxjs_.js -link -l gxjs-init static/hello.scm static/gxjs-rt.scm

<span style="color: #ECBE7B;">echo</span> Steal the registry init
<span style="color: #dcaeea;">_hello_mod_init</span>=<span style="color: #98be65;">"</span><span style="color: #51afef; font-weight: bold;">$(</span><span style="color: #51afef; font-weight: bold;">grep</span><span style="color: #51afef; font-weight: bold;"> -rE '^g_module_registry_init\(' REMOVE-gxjs_.js)</span><span style="color: #98be65;">"</span>

<span style="color: #ECBE7B;">echo</span> Init for registry: $<span style="color: #dcaeea;">_hello_mod_init</span>;
<span style="color: #ECBE7B;">rm</span> REMOVE-gxjs_.js

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Compile a link file from our hello to the _gambit.js runtime.</span>
gsc -target js -o gxjs-link.js -link static/hello.scm

<span style="color: #ECBE7B;">echo</span> Append replace the module init with the other one for our runtime.

sed -i <span style="color: #98be65;">"s/^g_module_registry_init(.*/$_hello_mod_init/"</span> gxjs-link.js

gsc -target js -o hello.js static/hello.scm
gsc -target js -o gxjs-rt.js static/gxjs-rt.scm

<span style="color: #dcaeea;">_gxjs_rt</span>=<span style="color: #98be65;">'</span><span style="color: #98be65;">cat</span><span style="color: #98be65;"> gxjs-link.js gxjs-init.js hello.js gxjs-rt.js &gt; gxjs.js'</span>; <span style="color: #ECBE7B;">echo</span> making exec: $<span style="color: #dcaeea;">_gxjs_rt</span>; bash -c <span style="color: #98be65;">"$_gxjs_rt"</span>;
</pre>
</div>
</div>
</div>
