doc/log/0002_Lazy-Dynamic-Module-Init.org
** Small FFI

With just a few namespace changes, back to our original hello.

#+begin_src scheme :tangle ../../gx/hello.ss
(extern namespace: "#" list->vector)
(extern namespace: js plist->jso alert)
(def linksData
  '((title: "Gerbil Docs" caption: "cons.io" icon: "school" link: "https://cons.io")
    (title: "Quasar Docs" caption: "quasar.dev" icon: "school" link: "https://quasar.dev")))


(##inline-host-statement
 " exports.links = (@1@);
console.log('this is linksdata:', (@1@));
"
 (list->vector (map plist->jso linksData)))


(##inline-host-statement
 "exports.Hello = (arg) => {
   var hello_fn = g_scm2host(@1@)
   hello_fn('Hello ' + arg)
}"
 (lambda (str) (alert str)))
#+end_src

Now build the [[#gxjsffi][~gxjs-ffi~]] and include it.

#+begin_src shell
_gxc () {
    _givr="gxc -d . -S -static $1"
 echo "--- Compiling $_givr"; $_givr || exit 1 ; echo;
}
_statics=""

_gsc () {
 _js=$(basename $1 .scm).js
 _statics="$_statics $1"

  echo "compiling $1 to $_js"
  gsc -target js -o  $_js $1 || exit 2; echo;
}

_comp () {
 _fn=$(basename $1 .ss)
 _st=static/$_fn.scm

 _gxc $1;
 _gsc $_st;
 }


echo "Compile the base -l library gxjs-init.js"
_comp gxjs-init.ss
_statics=""
echo "----------------"; echo; echo;
_comp hello.ss
_comp gxjs-rt.ss
_comp gxjs-ffi.ss

echo "Make a link file from our file to this runtime"
gsc -target js -o REMOVE-gxjs_.js -link -l gxjs-init $_statics

echo Steal the registry init
_hello_mod_init="$(grep -rE '^g_module_registry_init\(' REMOVE-gxjs_.js)"

echo Init for registry: $_hello_mod_init;
rm REMOVE-gxjs_.js

# Compile a link file from our statics to the _gambit.js runtime.
gsc -target js -o gxjs-link.js -link $_statics

echo Append replace the module init with the other one for our runtime.

sed -i "s/^g_module_registry_init(.*/$_hello_mod_init/" gxjs-link.js

_gxjs_rt='cat gxjs-link.js gxjs-init.js gxjs-rt.js gxjs-ffi.js hello.js > gxjs.js'; echo making exec: $_gxjs_rt; bash -c "$_gxjs_rt";
#+end_src

