log/0002_Lazy-Dynamic-Module-Init.html

<div id="outline-container-org85a14e1" class="outline-3">
<h3 id="org85a14e1"><span class="section-number-3">4.3</span> Small FFI</h3>
<div class="outline-text-3" id="text-4-3">
<p>
With just a few namespace changes, back to our original hello.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #51afef;">extern</span> <span style="color: #c678dd;">namespace:</span> <span style="color: #98be65;">"#"</span> list-&gt;vector)
(<span style="color: #51afef;">extern</span> <span style="color: #c678dd;">namespace:</span> js plist-&gt;jso alert)
(<span style="color: #51afef;">def</span> <span style="color: #c678dd;">linksData</span>
  <span style="color: #51afef;">'</span>((<span style="color: #c678dd;">title:</span> <span style="color: #98be65;">"Gerbil Docs"</span> <span style="color: #c678dd;">caption:</span> <span style="color: #98be65;">"cons.io"</span> <span style="color: #c678dd;">icon:</span> <span style="color: #98be65;">"school"</span> <span style="color: #c678dd;">link:</span> <span style="color: #98be65;">"https://cons.io"</span>)
    (<span style="color: #c678dd;">title:</span> <span style="color: #98be65;">"Quasar Docs"</span> <span style="color: #c678dd;">caption:</span> <span style="color: #98be65;">"quasar.dev"</span> <span style="color: #c678dd;">icon:</span> <span style="color: #98be65;">"school"</span> <span style="color: #c678dd;">link:</span> <span style="color: #98be65;">"https://quasar.dev"</span>)))


(<span style="color: #c678dd;">##</span>inline-host-statement
 <span style="color: #98be65;">" exports.links = (@1@);</span>
<span style="color: #98be65;">console.log('this is linksdata:', (@1@));</span>
<span style="color: #98be65;">"</span>
 (list-&gt;vector (<span style="color: #51afef;">map</span> plist-&gt;jso linksData)))


(<span style="color: #c678dd;">##</span>inline-host-statement
 <span style="color: #98be65;">"exports.Hello = (arg) =&gt; {</span>
<span style="color: #98be65;">   var hello_fn = g_scm2host(@1@)</span>
<span style="color: #98be65;">   hello_fn('Hello ' + arg)</span>
<span style="color: #98be65;">}"</span>
 (<span style="color: #51afef;">lambda</span> (str) (alert str)))
</pre>
</div>

<p>
Now build the <a href="#gxjsffi"><code>gxjs-ffi</code></a> and include it.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #c678dd;">_gxc</span> <span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #dcaeea;">_givr</span>=<span style="color: #98be65;">"gxc -d . -S -static </span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">1</span><span style="color: #98be65;">"</span>
 <span style="color: #ECBE7B;">echo</span> <span style="color: #98be65;">"--- Compiling $_givr"</span>; $<span style="color: #dcaeea;">_givr</span> || <span style="color: #51afef;">exit</span> <span style="color: #da8548; font-weight: bold;">1</span> ; <span style="color: #ECBE7B;">echo</span>;
<span style="color: #51afef;">}</span>
<span style="color: #dcaeea;">_statics</span>=<span style="color: #98be65;">""</span>

<span style="color: #c678dd;">_gsc</span> <span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
 <span style="color: #dcaeea;">_js</span>=$<span style="color: #c678dd;">(</span><span style="color: #51afef; font-weight: bold;">basename</span> $<span style="color: #da8548; font-weight: bold;">1</span> .scm<span style="color: #c678dd;">)</span>.js
 <span style="color: #dcaeea;">_statics</span>=<span style="color: #98be65;">"$_statics </span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">1</span><span style="color: #98be65;">"</span>

  <span style="color: #ECBE7B;">echo</span> <span style="color: #98be65;">"compiling </span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">1</span><span style="color: #98be65;"> to $_js"</span>
  gsc -target js -o  $<span style="color: #dcaeea;">_js</span> $<span style="color: #da8548; font-weight: bold;">1</span> || <span style="color: #51afef;">exit</span> <span style="color: #da8548; font-weight: bold;">2</span>; <span style="color: #ECBE7B;">echo</span>;
<span style="color: #51afef;">}</span>

<span style="color: #c678dd;">_comp</span> <span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
 <span style="color: #dcaeea;">_fn</span>=$<span style="color: #c678dd;">(</span><span style="color: #51afef; font-weight: bold;">basename</span> $<span style="color: #da8548; font-weight: bold;">1</span> .ss<span style="color: #c678dd;">)</span>
 <span style="color: #dcaeea;">_st</span>=static/$<span style="color: #dcaeea;">_fn</span>.scm

 _gxc $<span style="color: #da8548; font-weight: bold;">1</span>;
 _gsc $<span style="color: #dcaeea;">_st</span>;
 <span style="color: #51afef;">}</span>


<span style="color: #ECBE7B;">echo</span> <span style="color: #98be65;">"Compile the base -l library gxjs-init.js"</span>
_comp gxjs-init.ss
<span style="color: #dcaeea;">_statics</span>=<span style="color: #98be65;">""</span>
<span style="color: #ECBE7B;">echo</span> <span style="color: #98be65;">"----------------"</span>; <span style="color: #ECBE7B;">echo</span>; <span style="color: #ECBE7B;">echo</span>;
_comp hello.ss
_comp gxjs-rt.ss
_comp gxjs-ffi.ss

<span style="color: #ECBE7B;">echo</span> <span style="color: #98be65;">"Make a link file from our file to this runtime"</span>
gsc -target js -o REMOVE-gxjs_.js -link -l gxjs-init $<span style="color: #dcaeea;">_statics</span>

<span style="color: #ECBE7B;">echo</span> Steal the registry init
<span style="color: #dcaeea;">_hello_mod_init</span>=<span style="color: #98be65;">"</span><span style="color: #51afef; font-weight: bold;">$(</span><span style="color: #51afef; font-weight: bold;">grep</span><span style="color: #51afef; font-weight: bold;"> -rE '^g_module_registry_init\(' REMOVE-gxjs_.js)</span><span style="color: #98be65;">"</span>

<span style="color: #ECBE7B;">echo</span> Init for registry: $<span style="color: #dcaeea;">_hello_mod_init</span>;
<span style="color: #ECBE7B;">rm</span> REMOVE-gxjs_.js

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Compile a link file from our statics to the _gambit.js runtime.</span>
gsc -target js -o gxjs-link.js -link $<span style="color: #dcaeea;">_statics</span>

<span style="color: #ECBE7B;">echo</span> Append replace the module init with the other one for our runtime.

sed -i <span style="color: #98be65;">"s/^g_module_registry_init(.*/$_hello_mod_init/"</span> gxjs-link.js

<span style="color: #dcaeea;">_gxjs_rt</span>=<span style="color: #98be65;">'</span><span style="color: #98be65;">cat</span><span style="color: #98be65;"> gxjs-link.js gxjs-init.js gxjs-rt.js gxjs-ffi.js hello.js &gt; gxjs.js'</span>; <span style="color: #ECBE7B;">echo</span> making exec: $<span style="color: #dcaeea;">_gxjs_rt</span>; bash -c <span style="color: #98be65;">"$_gxjs_rt"</span>;
</pre>
</div>
</div>
</div>
