doc/log/0002_Lazy-Dynamic-Module-Init.org
** Separate Lazy Hello

At this point we have everything we want in one JS, and one thing that we don't
want, the hello.

#+begin_src shell
_gxc () {
    _givr="gxc -d . -S -static $1"
 echo "--- Compiling $_givr"; $_givr || exit 1 ; echo;
}
_statics=""

_gsc () {
 _js=$(basename $1 .scm).js
 _statics="$_statics $1"

  echo "compiling $1 to $_js"
  gsc -target js -o  $_js $1 || exit 2; echo;
}

_comp () {
 _fn=$(basename $1 .ss)
 _st=static/$_fn.scm

 _gxc $1;
 _gsc $_st;
 }


echo "Compile the base -l library gxjs-init.js"
_comp gxjs-init.ss
_statics=""
echo "----------------"; echo; echo;
_comp gxjs-rt.ss
_comp gxjs-ffi.ss

echo "Make a link file from our file to this runtime"
gsc -target js -o REMOVE-gxjs_.js -link -l gxjs-init $_statics

echo Steal the registry init
_hello_mod_init="$(grep -rE '^g_module_registry_init\(' REMOVE-gxjs_.js)"

echo Init for registry: $_hello_mod_init;
rm REMOVE-gxjs_.js

# Compile a link file from our statics to the _gambit.js runtime.
gsc -target js -o gxjs-link.js -link $_statics

echo Append replace the module init with the other one for our runtime.

echo not doing sed -i "s/^g_module_registry_init(.*/$_hello_mod_init/" gxjs-link.js

_gxjs_rt='cat gxjs-link.js gxjs-init.js gxjs-rt.js gxjs-ffi.js > gxjs.js'; echo making exec: $_gxjs_rt; bash -c "$_gxjs_rt";

echo Now a lazy hello
_comp hello.ss

cp hello.js gxjs.js button-counter.js ../public
#+end_src

#+RESULTS:

That gives us the ~js~ form we need. Notice we echo "not doing sed"

#+begin_src javascript :noweb-ref gxjs-mod-init-form
g_module_registry_init([new G_ModLinkInfo("gxjs-init",0),new G_ModLinkInfo("gxjs-rt",1),new G_ModLinkInfo("gxjs-ffi",2)]);
#+end_src

Now that this form is included in our init we can build our ~gxjs.js~ and try it
out WITHOUT THE ~sed~!!

Down at the very bottom of our link file is a module registry init.

#+begin_src javascript
g_module_registry_init([new G_ModLinkInfo("_gambit",0),new G_ModLinkInfo("gxjs-init",1),new G_ModLinkInfo("gxjs-rt",2),new G_ModLinkInfo("gxjs-ffi",3)]);
#+end_src

In the past we simply ~sed~'d it to our ~js~ form. But now we handle it
automagically. Just a matter of building the "modules" and con-~cat~-enate the
~js~ files.

