log/0002_Lazy-Dynamic-Module-Init.html

<div id="outline-container-orgc138955" class="outline-3">
<h3 id="orgc138955"><span class="section-number-3">4.4</span> Separate Lazy Hello</h3>
<div class="outline-text-3" id="text-4-4">
<p>
At this point we have everything we want in one JS, and one thing that we don&rsquo;t
want, the hello.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #c678dd;">_gxc</span> <span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #dcaeea;">_givr</span>=<span style="color: #98be65;">"gxc -d . -S -static </span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">1</span><span style="color: #98be65;">"</span>
 <span style="color: #ECBE7B;">echo</span> <span style="color: #98be65;">"--- Compiling $_givr"</span>; $<span style="color: #dcaeea;">_givr</span> || <span style="color: #51afef;">exit</span> <span style="color: #da8548; font-weight: bold;">1</span> ; <span style="color: #ECBE7B;">echo</span>;
<span style="color: #51afef;">}</span>
<span style="color: #dcaeea;">_statics</span>=<span style="color: #98be65;">""</span>

<span style="color: #c678dd;">_gsc</span> <span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
 <span style="color: #dcaeea;">_js</span>=$<span style="color: #c678dd;">(</span><span style="color: #51afef; font-weight: bold;">basename</span> $<span style="color: #da8548; font-weight: bold;">1</span> .scm<span style="color: #c678dd;">)</span>.js
 <span style="color: #dcaeea;">_statics</span>=<span style="color: #98be65;">"$_statics </span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">1</span><span style="color: #98be65;">"</span>

  <span style="color: #ECBE7B;">echo</span> <span style="color: #98be65;">"compiling </span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">1</span><span style="color: #98be65;"> to $_js"</span>
  gsc -target js -o  $<span style="color: #dcaeea;">_js</span> $<span style="color: #da8548; font-weight: bold;">1</span> || <span style="color: #51afef;">exit</span> <span style="color: #da8548; font-weight: bold;">2</span>; <span style="color: #ECBE7B;">echo</span>;
<span style="color: #51afef;">}</span>

<span style="color: #c678dd;">_comp</span> <span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
 <span style="color: #dcaeea;">_fn</span>=$<span style="color: #c678dd;">(</span><span style="color: #51afef; font-weight: bold;">basename</span> $<span style="color: #da8548; font-weight: bold;">1</span> .ss<span style="color: #c678dd;">)</span>
 <span style="color: #dcaeea;">_st</span>=static/$<span style="color: #dcaeea;">_fn</span>.scm

 _gxc $<span style="color: #da8548; font-weight: bold;">1</span>;
 _gsc $<span style="color: #dcaeea;">_st</span>;
 <span style="color: #51afef;">}</span>


<span style="color: #ECBE7B;">echo</span> <span style="color: #98be65;">"Compile the base -l library gxjs-init.js"</span>
_comp gxjs-init.ss
<span style="color: #dcaeea;">_statics</span>=<span style="color: #98be65;">""</span>
<span style="color: #ECBE7B;">echo</span> <span style="color: #98be65;">"----------------"</span>; <span style="color: #ECBE7B;">echo</span>; <span style="color: #ECBE7B;">echo</span>;
_comp gxjs-rt.ss
_comp gxjs-ffi.ss

<span style="color: #ECBE7B;">echo</span> <span style="color: #98be65;">"Make a link file from our file to this runtime"</span>
gsc -target js -o REMOVE-gxjs_.js -link -l gxjs-init $<span style="color: #dcaeea;">_statics</span>

<span style="color: #ECBE7B;">echo</span> Steal the registry init
<span style="color: #dcaeea;">_hello_mod_init</span>=<span style="color: #98be65;">"</span><span style="color: #51afef; font-weight: bold;">$(</span><span style="color: #51afef; font-weight: bold;">grep</span><span style="color: #51afef; font-weight: bold;"> -rE '^g_module_registry_init\(' REMOVE-gxjs_.js)</span><span style="color: #98be65;">"</span>

<span style="color: #ECBE7B;">echo</span> Init for registry: $<span style="color: #dcaeea;">_hello_mod_init</span>;
<span style="color: #ECBE7B;">rm</span> REMOVE-gxjs_.js

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Compile a link file from our statics to the _gambit.js runtime.</span>
gsc -target js -o gxjs-link.js -link $<span style="color: #dcaeea;">_statics</span>

<span style="color: #ECBE7B;">echo</span> Append replace the module init with the other one for our runtime.

<span style="color: #ECBE7B;">echo</span> not doing sed -i <span style="color: #98be65;">"s/^g_module_registry_init(.*/$_hello_mod_init/"</span> gxjs-link.js

<span style="color: #dcaeea;">_gxjs_rt</span>=<span style="color: #98be65;">'</span><span style="color: #98be65;">cat</span><span style="color: #98be65;"> gxjs-link.js gxjs-init.js gxjs-rt.js gxjs-ffi.js &gt; gxjs.js'</span>; <span style="color: #ECBE7B;">echo</span> making exec: $<span style="color: #dcaeea;">_gxjs_rt</span>; bash -c <span style="color: #98be65;">"$_gxjs_rt"</span>;

<span style="color: #ECBE7B;">echo</span> Now a lazy hello
_comp hello.ss

<span style="color: #ECBE7B;">cp</span> hello.js gxjs.js button-counter.js ../public
</pre>
</div>

<p>
That gives us the <code>js</code> form we need. Notice we echo &ldquo;not doing sed&rdquo;
</p>

<div class="org-src-container">
<pre class="src src-javascript">g_module_registry_init([<span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">G_ModLinkInfo</span>(<span style="color: #98be65;">"gxjs-init"</span>,<span style="color: #da8548; font-weight: bold;">0</span>),<span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">G_ModLinkInfo</span>(<span style="color: #98be65;">"gxjs-rt"</span>,<span style="color: #da8548; font-weight: bold;">1</span>),<span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">G_ModLinkInfo</span>(<span style="color: #98be65;">"gxjs-ffi"</span>,<span style="color: #da8548; font-weight: bold;">2</span>)]);
</pre>
</div>

<p>
Now that this form is included in our init we can build our <code>gxjs.js</code> and try it
out WITHOUT THE <code>sed</code>!!
</p>

<p>
Down at the very bottom of our link file is a module registry init.
</p>

<div class="org-src-container">
<pre class="src src-javascript">g_module_registry_init([<span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">G_ModLinkInfo</span>(<span style="color: #98be65;">"_gambit"</span>,<span style="color: #da8548; font-weight: bold;">0</span>),<span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">G_ModLinkInfo</span>(<span style="color: #98be65;">"gxjs-init"</span>,<span style="color: #da8548; font-weight: bold;">1</span>),<span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">G_ModLinkInfo</span>(<span style="color: #98be65;">"gxjs-rt"</span>,<span style="color: #da8548; font-weight: bold;">2</span>),<span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">G_ModLinkInfo</span>(<span style="color: #98be65;">"gxjs-ffi"</span>,<span style="color: #da8548; font-weight: bold;">3</span>)]);
</pre>
</div>

<p>
In the past we simply <code>sed</code>&rsquo;d it to our <code>js</code> form. But now we handle it
automagically. Just a matter of building the &ldquo;modules&rdquo; and con-<code>cat</code>-enate the
<code>js</code> files.
</p>
</div>
</div>
