log/0002_Lazy-Dynamic-Module-Init.html

<div id="outline-container-orgc38a3cb" class="outline-4">
<h4 id="orgc38a3cb"><span class="section-number-4">4.6.1</span> <code>error</code></h4>
<div class="outline-text-4" id="text-4-6-1">
<p>
I have no idea what <b>Gambit</b> does for/with conditions and <code>js</code>.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #51afef;">def</span> (<span style="color: #51afef;">error</span> thing)
  (<span style="color: #51afef;">if</span> (<span style="color: #c678dd;">##</span>string? thing)
    (<span style="color: #51afef;">set!</span> thing (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"g_scm2host(@1@)"</span> thing)))
  (<span style="color: #c678dd;">##</span>inline-host-statement <span style="color: #98be65;">"_e = (@1@);</span>
<span style="color: #98be65;">   if (_e instanceof Error) { throw _e } else { throw new Error(_e) };"</span> thing))
</pre>
</div>
</div>
</div>

<div id="outline-container-org1099071" class="outline-4">
<h4 id="org1099071"><span class="section-number-4">4.6.2</span> <code>length</code></h4>
<div class="outline-text-4" id="text-4-6-2">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">length</span> lst)
  (<span style="color: #51afef;">if</span> (null? lst) 0 (+ 1 (length (<span style="color: #c678dd;">##</span>cdr lst)))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #c678dd;">namespace:</span> <span style="color: #98be65;">"#"</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org55004f3" class="outline-4">
<h4 id="org55004f3"><span class="section-number-4">4.6.3</span> <code>list-&gt;vector</code></h4>
<div class="outline-text-4" id="text-4-6-3">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">list-&gt;vector</span> lst)
  (<span style="color: #51afef;">def</span> <span style="color: #c678dd;">n</span> (<span style="color: #c678dd;">##</span>length lst))
  (<span style="color: #51afef;">def</span> <span style="color: #c678dd;">vec</span> (<span style="color: #c678dd;">##</span>make-vector n))

  (<span style="color: #51afef;">let</span> <span style="color: #c678dd;">loop</span> ((i 0) (l lst))
    (<span style="color: #51afef;">if</span> (<span style="color: #51afef;">not</span> (null? l))
      (<span style="color: #51afef;">begin</span>
        (<span style="color: #c678dd;">##</span>vector-set! vec i (<span style="color: #c678dd;">##</span>car l))
        (loop (+ i 1) (<span style="color: #c678dd;">##</span>cdr l)))))
  vec)
</pre>
</div>
</div>
</div>

<div id="outline-container-org79b7731" class="outline-4">
<h4 id="org79b7731"><span class="section-number-4">4.6.4</span> <code>string-append</code></h4>
<div class="outline-text-4" id="text-4-6-4">
<p>
I don&rsquo;t (yet) seem to have <code>##apply</code> at runtime (though may &#x2026; commented and
not tried) so this is somewhat ineffecient and shorthand.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">string-append</span> . strs)
  (<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">strapp</span> s1 s2)
    (<span style="color: #51afef;">let*</span> ((l1 (<span style="color: #c678dd;">##</span>string-length s1))
           (l2 (<span style="color: #c678dd;">##</span>string-length s2))
           (l3 (+ l1 l2))
           (s3 (<span style="color: #c678dd;">##</span>make-string l3)))
      (<span style="color: #51afef;">let</span> <span style="color: #c678dd;">lp</span> ((n 0))
        (<span style="color: #51afef;">if</span> (&lt; n l1)
          (<span style="color: #c678dd;">##</span>string-set! s3 n (<span style="color: #c678dd;">##</span>string-ref s1 n))
          (<span style="color: #51afef;">if</span> (&gt;= n l1)
            (<span style="color: #c678dd;">##</span>string-set! s3 n (<span style="color: #c678dd;">##</span>string-ref s2 (- n l1)))))
      (<span style="color: #51afef;">if</span> (&lt; n l3) (lp (+ 1 n))))
                                        <span style="color: #5B6268;">;</span><span style="color: #5B6268;">(##apply string-append s3 rst)</span>
      s3))

  (<span style="color: #51afef;">def</span> <span style="color: #c678dd;">str</span> (car strs))

  (<span style="color: #51afef;">let</span> <span style="color: #c678dd;">applp</span> ((lst (cdr strs)))
    (<span style="color: #51afef;">if</span> (null? lst) str
        (<span style="color: #51afef;">begin</span> (<span style="color: #51afef;">set!</span> str (strapp str (car lst)))
               (applp (cdr lst))))))
</pre>
</div>
</div>
</div>


<div id="outline-container-org24ba4db" class="outline-4">
<h4 id="org24ba4db"><span class="section-number-4">4.6.5</span> <i>File</i> <code>gxjs-rt.ss</code></h4>
<div class="outline-text-4" id="text-4-6-5">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #c678dd;">namespace:</span> <span style="color: #98be65;">"#"</span>
(<span style="color: #51afef;">declare</span> (<span style="color: #51afef;">not</span> inline))

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">(define (apply proc arg1 . rest)</span>
<span style="color: #5B6268;">;;   </span><span style="color: #5B6268;">(if (##pair? rest)</span>

<span style="color: #5B6268;">;;       </span><span style="color: #5B6268;">(let loop ((prev arg1) (lst rest))</span>
<span style="color: #5B6268;">;;         </span><span style="color: #5B6268;">(let ((temp (##car lst)))</span>
<span style="color: #5B6268;">;;           </span><span style="color: #5B6268;">(##set-car! lst prev)</span>
<span style="color: #5B6268;">;;           </span><span style="color: #5B6268;">(let ((tail (##cdr lst)))</span>
<span style="color: #5B6268;">;;             </span><span style="color: #5B6268;">(if (##pair? tail)</span>
<span style="color: #5B6268;">;;                 </span><span style="color: #5B6268;">(loop temp tail)</span>
<span style="color: #5B6268;">;;                 </span><span style="color: #5B6268;">(begin</span>
<span style="color: #5B6268;">;;                   </span><span style="color: #5B6268;">(##set-cdr! lst temp)</span>
<span style="color: #5B6268;">;;                   </span><span style="color: #5B6268;">(##apply proc rest))))))</span>

<span style="color: #5B6268;">;;       </span><span style="color: #5B6268;">(##apply proc arg1)))</span>

(<span style="color: #51afef;">def</span> (<span style="color: #51afef;">error</span> thing)
  (<span style="color: #51afef;">if</span> (<span style="color: #c678dd;">##</span>string? thing)
    (<span style="color: #51afef;">set!</span> thing (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"g_scm2host(@1@)"</span> thing)))
  (<span style="color: #c678dd;">##</span>inline-host-statement <span style="color: #98be65;">"_e = (@1@);</span>
<span style="color: #98be65;">   if (_e instanceof Error) { throw _e } else { throw new Error(_e) };"</span> thing))

(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">length</span> lst)
  (<span style="color: #51afef;">if</span> (null? lst) 0 (+ 1 (length (<span style="color: #c678dd;">##</span>cdr lst)))))

(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">list-&gt;vector</span> lst)
  (<span style="color: #51afef;">def</span> <span style="color: #c678dd;">n</span> (<span style="color: #c678dd;">##</span>length lst))
  (<span style="color: #51afef;">def</span> <span style="color: #c678dd;">vec</span> (<span style="color: #c678dd;">##</span>make-vector n))

  (<span style="color: #51afef;">let</span> <span style="color: #c678dd;">loop</span> ((i 0) (l lst))
    (<span style="color: #51afef;">if</span> (<span style="color: #51afef;">not</span> (null? l))
      (<span style="color: #51afef;">begin</span>
        (<span style="color: #c678dd;">##</span>vector-set! vec i (<span style="color: #c678dd;">##</span>car l))
        (loop (+ i 1) (<span style="color: #c678dd;">##</span>cdr l)))))
  vec)

(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">string-append</span> . strs)
  (<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">strapp</span> s1 s2)
    (<span style="color: #51afef;">let*</span> ((l1 (<span style="color: #c678dd;">##</span>string-length s1))
           (l2 (<span style="color: #c678dd;">##</span>string-length s2))
           (l3 (+ l1 l2))
           (s3 (<span style="color: #c678dd;">##</span>make-string l3)))
      (<span style="color: #51afef;">let</span> <span style="color: #c678dd;">lp</span> ((n 0))
        (<span style="color: #51afef;">if</span> (&lt; n l1)
          (<span style="color: #c678dd;">##</span>string-set! s3 n (<span style="color: #c678dd;">##</span>string-ref s1 n))
          (<span style="color: #51afef;">if</span> (&gt;= n l1)
            (<span style="color: #c678dd;">##</span>string-set! s3 n (<span style="color: #c678dd;">##</span>string-ref s2 (- n l1)))))
      (<span style="color: #51afef;">if</span> (&lt; n l3) (lp (+ 1 n))))
                                        <span style="color: #5B6268;">;</span><span style="color: #5B6268;">(##apply string-append s3 rst)</span>
      s3))

  (<span style="color: #51afef;">def</span> <span style="color: #c678dd;">str</span> (car strs))

  (<span style="color: #51afef;">let</span> <span style="color: #c678dd;">applp</span> ((lst (cdr strs)))
    (<span style="color: #51afef;">if</span> (null? lst) str
        (<span style="color: #51afef;">begin</span> (<span style="color: #51afef;">set!</span> str (strapp str (car lst)))
               (applp (cdr lst))))))

</pre>
</div>
</div>
</div>
</div>
