doc/log/0002_Lazy-Dynamic-Module-Init.org
** ~gxjs-ffi~
:PROPERTIES:
:CUSTOM_ID: gxjsffi
:END:

All of these will be placed in the ~js#~ namespace.

*Gambit* has ~foreign~ types.

#+begin_src scheme :noweb-ref js->foreign
(def (js->foreign obj)
  (##inline-host-expression "g_host2foreign(@1@);" obj))
#+end_src

#+begin_src scheme :noweb-ref foreign->js
(def (foreign->js obj)
  (if (not (##foreign? obj))
    (##error "Not a foreign object"))
  (##inline-host-expression "g_foreign2host(@1@);" obj))

#+end_src
This is useful as well. Somewhat cribbed from *gambit-scm-2-js*[fn:gs2js]

#+begin_src scheme :noweb-ref scm->js
(def (scm->js obj)
  (begin
    (##inline-host-statement "var result;")
    (##inline-host-statement "try {result = g_scm2host(@1@);} catch (e) {result = Error(e);}" obj)
    (let ((result (##inline-host-expression "result;")))
      (if (js->scm (##inline-host-expression "@1@ instanceof Error;" result))
          (##error result)
          result))))

(def (js->scm obj)
  (##inline-host-expression "g_host2scm(@1@);" obj))
#+end_src

#+begin_src scheme :noweb-ref plist->jso
(def (plist->jso plist)
  (def jso (##make-vector 0))
  (def (p->o p)
    (if (null? p) jso
        (begin ; (console.log p)
               (set! jso (##vector-set!
                          jso (##car p)
                          (let ((obj (##cadr p)))
                            (if (##foreign? obj)
                              (##inline-host-expression "g_foreign2host(@1@);" obj)
                             ; (if (##procedure? obj) obj
                              (##inline-host-expression "g_scm2host(@1@);" obj)))))
               (p->o (##cddr p)))))
  (##inline-host-expression "Object.fromEntries(Object.entries(@1@));" (p->o plist)))
#+end_src


*** /File/ ~gxjs-ffi.ss~
#+begin_src scheme :tangle ../../gx/gxjs-ffi.ss :noweb yes
namespace: js

(def (alert thing) (##inline-host-statement "var foo = (@1@);
  var bar = typeof foo === 'string' ? foo : g_scm2host(foo)
  alert(bar);" thing))
(def (console.log obj) (##inline-host-statement "console.log((@1@))" obj))
(def (console.error obj) (##inline-host-statement "console.error((@1@))" obj))

{%js->foreign%}
{%foreign->js%}

{%scm->js%}

{%plist->jso%}
#+end_src

* Putting it all together

Now that we have almost everything lazy/dynamic, we want to get back to our
original index.

We'll have 3 steps.

 1) ~gxjs~ :: Our basic run time
 2) All the lazy modules
 3) The gambit repl (done the old way)

Our ~_comp~ shell function takes a ~.ss~, makes a ~static/.scm~ and compiles that to a ~.js~.

#+begin_src shell :noweb-ref compiler-shell
_gxc () {
    _givr="gxc -d . -S -static $1"
 echo "--- Compiling $_givr"; $_givr || exit 1 ;
}
_statics=""

_gsc () {
 _js=$(basename $1 .scm).js
 _statics="$_statics $1"

  echo "--- compiling $1 to $_js"
  gsc -target js -o  $_js $1 || exit 2; echo;
}

_comp () {
 _fn=$(basename $1 .ss)
 _st=static/$_fn.scm

 _gxc $1;
 _gsc $_st;
 }
#+end_src

