log/0002_Lazy-Dynamic-Module-Init.html

<div id="outline-container-gxjsffi" class="outline-3">
<h3 id="gxjsffi"><span class="section-number-3">4.7</span> <code>gxjs-ffi</code></h3>
<div class="outline-text-3" id="text-gxjsffi">
<p>
All of these will be placed in the <code>js#</code> namespace.
</p>

<p>
<b>Gambit</b> has <code>foreign</code> types.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">js-&gt;foreign</span> obj)
  (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"g_host2foreign(@1@);"</span> obj))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">foreign-&gt;js</span> obj)
  (<span style="color: #51afef;">if</span> (<span style="color: #51afef;">not</span> (<span style="color: #c678dd;">##</span>foreign? obj))
    (<span style="color: #c678dd;">##</span>error <span style="color: #98be65;">"Not a foreign object"</span>))
  (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"g_foreign2host(@1@);"</span> obj))

</pre>
</div>
<p>
This is useful as well. Somewhat cribbed from <b>gambit-scm-2-js</b><sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup>
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">scm-&gt;js</span> obj)
  (<span style="color: #51afef;">begin</span>
    (<span style="color: #c678dd;">##</span>inline-host-statement <span style="color: #98be65;">"var result;"</span>)
    (<span style="color: #c678dd;">##</span>inline-host-statement <span style="color: #98be65;">"try {result = g_scm2host(@1@);} catch (e) {result = Error(e);}"</span> obj)
    (<span style="color: #51afef;">let</span> ((result (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"result;"</span>)))
      (<span style="color: #51afef;">if</span> (js-&gt;scm (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"@1@ instanceof Error;"</span> result))
          (<span style="color: #c678dd;">##</span>error result)
          result))))

(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">js-&gt;scm</span> obj)
  (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"g_host2scm(@1@);"</span> obj))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">plist-&gt;jso</span> plist)
  (<span style="color: #51afef;">def</span> <span style="color: #c678dd;">jso</span> (<span style="color: #c678dd;">##</span>make-vector 0))
  (<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">p-&gt;o</span> p)
    (<span style="color: #51afef;">if</span> (null? p) jso
        (<span style="color: #51afef;">begin</span> <span style="color: #5B6268;">; </span><span style="color: #5B6268;">(console.log p)</span>
               (<span style="color: #51afef;">set!</span> jso (<span style="color: #c678dd;">##</span>vector-set!
                          jso (<span style="color: #c678dd;">##</span>car p)
                          (<span style="color: #51afef;">let</span> ((obj (<span style="color: #c678dd;">##</span>cadr p)))
                            (<span style="color: #51afef;">if</span> (<span style="color: #c678dd;">##</span>foreign? obj)
                              (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"g_foreign2host(@1@);"</span> obj)
                             <span style="color: #5B6268;">; </span><span style="color: #5B6268;">(if (##procedure? obj) obj</span>
                              (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"g_scm2host(@1@);"</span> obj)))))
               (p-&gt;o (<span style="color: #c678dd;">##</span>cddr p)))))
  (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"Object.fromEntries(Object.entries(@1@));"</span> (p-&gt;o plist)))
</pre>
</div>
</div>


<div id="outline-container-org1c9fe92" class="outline-4">
<h4 id="org1c9fe92"><span class="section-number-4">4.7.1</span> <i>File</i> <code>gxjs-ffi.ss</code></h4>
<div class="outline-text-4" id="text-4-7-1">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #c678dd;">namespace:</span> js

(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">alert</span> thing) (<span style="color: #c678dd;">##</span>inline-host-statement <span style="color: #98be65;">"var foo = (@1@);</span>
<span style="color: #98be65;">  var bar = typeof foo === 'string' ? foo : g_scm2host(foo)</span>
<span style="color: #98be65;">  alert(bar);"</span> thing))
(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">console.log</span> obj) (<span style="color: #c678dd;">##</span>inline-host-statement <span style="color: #98be65;">"console.log((@1@))"</span> obj))
(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">console.error</span> obj) (<span style="color: #c678dd;">##</span>inline-host-statement <span style="color: #98be65;">"console.error((@1@))"</span> obj))

(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">js-&gt;foreign</span> obj)
  (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"g_host2foreign(@1@);"</span> obj))
(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">foreign-&gt;js</span> obj)
  (<span style="color: #51afef;">if</span> (<span style="color: #51afef;">not</span> (<span style="color: #c678dd;">##</span>foreign? obj))
    (<span style="color: #c678dd;">##</span>error <span style="color: #98be65;">"Not a foreign object"</span>))
  (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"g_foreign2host(@1@);"</span> obj))


(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">scm-&gt;js</span> obj)
  (<span style="color: #51afef;">begin</span>
    (<span style="color: #c678dd;">##</span>inline-host-statement <span style="color: #98be65;">"var result;"</span>)
    (<span style="color: #c678dd;">##</span>inline-host-statement <span style="color: #98be65;">"try {result = g_scm2host(@1@);} catch (e) {result = Error(e);}"</span> obj)
    (<span style="color: #51afef;">let</span> ((result (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"result;"</span>)))
      (<span style="color: #51afef;">if</span> (js-&gt;scm (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"@1@ instanceof Error;"</span> result))
          (<span style="color: #c678dd;">##</span>error result)
          result))))

(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">js-&gt;scm</span> obj)
  (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"g_host2scm(@1@);"</span> obj))

(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">plist-&gt;jso</span> plist)
  (<span style="color: #51afef;">def</span> <span style="color: #c678dd;">jso</span> (<span style="color: #c678dd;">##</span>make-vector 0))
  (<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">p-&gt;o</span> p)
    (<span style="color: #51afef;">if</span> (null? p) jso
        (<span style="color: #51afef;">begin</span> <span style="color: #5B6268;">; </span><span style="color: #5B6268;">(console.log p)</span>
               (<span style="color: #51afef;">set!</span> jso (<span style="color: #c678dd;">##</span>vector-set!
                          jso (<span style="color: #c678dd;">##</span>car p)
                          (<span style="color: #51afef;">let</span> ((obj (<span style="color: #c678dd;">##</span>cadr p)))
                            (<span style="color: #51afef;">if</span> (<span style="color: #c678dd;">##</span>foreign? obj)
                              (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"g_foreign2host(@1@);"</span> obj)
                             <span style="color: #5B6268;">; </span><span style="color: #5B6268;">(if (##procedure? obj) obj</span>
                              (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"g_scm2host(@1@);"</span> obj)))))
               (p-&gt;o (<span style="color: #c678dd;">##</span>cddr p)))))
  (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"Object.fromEntries(Object.entries(@1@));"</span> (p-&gt;o plist)))
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org6baee68" class="outline-2">
<h2 id="org6baee68"><span class="section-number-2">5</span> Putting it all together</h2>
<div class="outline-text-2" id="text-5">
<p>
Now that we have almost everything lazy/dynamic, we want to get back to our
original index.
</p>

<p>
We&rsquo;ll have 3 steps.
</p>

<ol class="org-ol">
<li><code>gxjs</code> :: Our basic run time</li>
<li>All the lazy modules</li>
<li>The gambit repl (done the old way)</li>
</ol>

<p>
Our <code>_comp</code> shell function takes a <code>.ss</code>, makes a <code>static/.scm</code> and compiles that to a <code>.js</code>.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #c678dd;">_gxc</span> <span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #dcaeea;">_givr</span>=<span style="color: #98be65;">"gxc -d . -S -static </span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">1</span><span style="color: #98be65;">"</span>
 <span style="color: #ECBE7B;">echo</span> <span style="color: #98be65;">"--- Compiling $_givr"</span>; $<span style="color: #dcaeea;">_givr</span> || <span style="color: #51afef;">exit</span> <span style="color: #da8548; font-weight: bold;">1</span> ;
<span style="color: #51afef;">}</span>
<span style="color: #dcaeea;">_statics</span>=<span style="color: #98be65;">""</span>

<span style="color: #c678dd;">_gsc</span> <span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
 <span style="color: #dcaeea;">_js</span>=$<span style="color: #c678dd;">(</span><span style="color: #51afef; font-weight: bold;">basename</span> $<span style="color: #da8548; font-weight: bold;">1</span> .scm<span style="color: #c678dd;">)</span>.js
 <span style="color: #dcaeea;">_statics</span>=<span style="color: #98be65;">"$_statics </span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">1</span><span style="color: #98be65;">"</span>

  <span style="color: #ECBE7B;">echo</span> <span style="color: #98be65;">"--- compiling </span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">1</span><span style="color: #98be65;"> to $_js"</span>
  gsc -target js -o  $<span style="color: #dcaeea;">_js</span> $<span style="color: #da8548; font-weight: bold;">1</span> || <span style="color: #51afef;">exit</span> <span style="color: #da8548; font-weight: bold;">2</span>; <span style="color: #ECBE7B;">echo</span>;
<span style="color: #51afef;">}</span>

<span style="color: #c678dd;">_comp</span> <span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
 <span style="color: #dcaeea;">_fn</span>=$<span style="color: #c678dd;">(</span><span style="color: #51afef; font-weight: bold;">basename</span> $<span style="color: #da8548; font-weight: bold;">1</span> .ss<span style="color: #c678dd;">)</span>
 <span style="color: #dcaeea;">_st</span>=static/$<span style="color: #dcaeea;">_fn</span>.scm

 _gxc $<span style="color: #da8548; font-weight: bold;">1</span>;
 _gsc $<span style="color: #dcaeea;">_st</span>;
 <span style="color: #51afef;">}</span>
</pre>
</div>
</div>
