doc/log/0002_Lazy-Dynamic-Module-Init.org
** Build ~gxjs~

#+begin_src shell :noweb-ref build-gxjs
_comp gxjs-init.ss
_comp gxjs-rt.ss
_comp gxjs-ffi.ss

echo "Compiling a gxjs-link.js file from our statics and the _gambit.js runtime."
gsc -target js -o gxjs-link.js -link $_statics

_gxjs_rt='cat gxjs-link.js gxjs-init.js gxjs-rt.js gxjs-ffi.js > gxjs.js'; echo making exec: $_gxjs_rt; bash -c "$_gxjs_rt";

cp gxjs.js ../public/
#+end_src

** Build the modules

1) vue
2) hello
3) gambit-module-test
4) button-counter

#+begin_src shell :noweb-ref build-modules
_comp vue.ss
_comp hello.ss
_comp gambit-module-test.ss
_comp button-counter.ss

cp vue.js hello.js gambit-module-test.js button-counter.js ../public
#+end_src

*** ~gambit-module-test.ss~: A module not loaded in the gambit program

#+begin_src scheme :tangle ../../gx/gambit-module-test.ss
(##inline-host-statement
 "exports.Test = (arg) => {
   var hello_fn = g_scm2host(@1@)
   hello_fn('Test' + arg)
}

console.log('init gambit-module-test');

"
 (lambda (str)
   (let* ((mod (##inline-host-expression "g_module_name(gx_gambit_module_table[1]);")))
     (js#console.log mod)
     (js#alert str))))
#+end_src

** Now the full gambit repl

This time we try without the module reset/init.

#+begin_src shell :noweb-ref build-repl
_comp lazy-gambit-repl.ss
_lazy="cat lazy-gambit-repl.js $(gsc -e '(display (path-expand "~~lib/_gambit.js"))')  > gambit-repl.js"
echo Building the gambit repl: \"$_lazy\"; bash -c "$_lazy";
cp gambit-repl.js ../public
#+end_src


#+begin_src scheme :tangle ../../gx/lazy-gambit-repl.ss
(import :gerbil/gambit)
(declare (extended-bindings))

(##inline-host-statement
 "exports.evalElement = (arg) => {
  alert('Lazy? This is working without the reset Hello ' + arg)
}"
)

(define (document.getElementById id)
  (##inline-host-expression "g_host2foreign(document.getElementById(g_scm2host(@1@)))" id))

(define (Element.innerText-ref elem)
  (##inline-host-expression "g_host2scm(g_foreign2host(@1@).innerText)" elem))

(define (g-sourceCodeRun id)
  (let* ((elem (document.getElementById id))
         (code (Element.innerText-ref elem)))
    (let ((expr (cons '##begin (with-input-from-string code read-all))))
      (eval expr))

    ))

(##inline-host-declaration "g_sourceCodeRun = function () { alert('sourceCodeRun'); };")

(##inline-host-statement "
g_sourceCodeRun = g_scm2host(@1@);
exports.sourceCodeRun = g_sourceCodeRun;" g-sourceCodeRun)

#+end_src
* Boot File

Everything that lazy-loads relies on the ~gxjs.js~ runtime. *Quasar* has a ~/boot~ folder which runs things before it runs things as it were.

https://quasar.dev/quasar-cli/boot-files is a good resource.

#+begin_src javascript :tangle ../../src/boot/gxjs.js
import 'app/public/gxjs.js'
export default ({ app, router, store, Vue }) => {
  // something to do
}
#+end_src

This must be added to ~quasar.conf.js~

#+begin_src javascript
boot: [
  'axios',
  'gxjs'
],
#+end_src

* ~LogIndex.vue~, a logs component

Eventually this will become a lot of our code as exporting the logs to json and then *Vue*'ing them is a wonderful task to grow code in.

For now :

#+begin_src vue :tangle ../../src/components/LogIndex.vue
<template>
      <div class="q-pa-md">
        Here is the <a href="log/index.html" target="log_iframe"> index </a> of the ongoing saga that is <strong>gxQuasar</strong>
    <q-layout view="lHh Lpr lFf" container style="height: 60vh" class="shadow-2 rounded-borders">
      <q-page-container>
        <q-page padding>
          <iframe class="resp-iframe"
                  src="log/index.html"
                  name="log_iframe"
                  height="50000"
                  allowfullscreen> </iframe>
        </q-page>
      </q-page-container>
    </q-layout>
  </div>
</template>

<style>
  .resp-iframe {
    position: absolute;
    top: 0;
    left: 0;
    width: 100%;
    height: 100%;
    border: 0;
}
</style>

<script>
export default {
  name: 'LogIndex'
}
</script>

#+end_src

