log/0002_Lazy-Dynamic-Module-Init.html

<div id="outline-container-org2552d88" class="outline-3">
<h3 id="org2552d88"><span class="section-number-3">5.1</span> Build <code>gxjs</code></h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-shell">_comp gxjs-init.ss
_comp gxjs-rt.ss
_comp gxjs-ffi.ss

<span style="color: #ECBE7B;">echo</span> <span style="color: #98be65;">"Compiling a gxjs-link.js file from our statics and the _gambit.js runtime."</span>
gsc -target js -o gxjs-link.js -link $<span style="color: #dcaeea;">_statics</span>

<span style="color: #dcaeea;">_gxjs_rt</span>=<span style="color: #98be65;">'</span><span style="color: #98be65;">cat</span><span style="color: #98be65;"> gxjs-link.js gxjs-init.js gxjs-rt.js gxjs-ffi.js &gt; gxjs.js'</span>; <span style="color: #ECBE7B;">echo</span> making exec: $<span style="color: #dcaeea;">_gxjs_rt</span>; bash -c <span style="color: #98be65;">"$_gxjs_rt"</span>;

<span style="color: #ECBE7B;">cp</span> gxjs.js ../public/
</pre>
</div>
</div>
</div>

<div id="outline-container-org111bce6" class="outline-3">
<h3 id="org111bce6"><span class="section-number-3">5.2</span> Build the modules</h3>
<div class="outline-text-3" id="text-5-2">
<ol class="org-ol">
<li>vue</li>
<li>hello</li>
<li>gambit-module-test</li>
<li>button-counter</li>
</ol>

<div class="org-src-container">
<pre class="src src-shell">_comp vue.ss
_comp hello.ss
_comp gambit-module-test.ss
_comp button-counter.ss

<span style="color: #ECBE7B;">cp</span> vue.js hello.js gambit-module-test.js button-counter.js ../public
</pre>
</div>
</div>

<div id="outline-container-org673bfba" class="outline-4">
<h4 id="org673bfba"><span class="section-number-4">5.2.1</span> <code>gambit-module-test.ss</code>: A module not loaded in the gambit program</h4>
<div class="outline-text-4" id="text-5-2-1">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #c678dd;">##</span>inline-host-statement
 <span style="color: #98be65;">"exports.Test = (arg) =&gt; {</span>
<span style="color: #98be65;">   var hello_fn = g_scm2host(@1@)</span>
<span style="color: #98be65;">   hello_fn('Test' + arg)</span>
<span style="color: #98be65;">}</span>

<span style="color: #98be65;">console.log('init gambit-module-test');</span>

<span style="color: #98be65;">"</span>
 (<span style="color: #51afef;">lambda</span> (str)
   (<span style="color: #51afef;">let*</span> ((mod (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"g_module_name(gx_gambit_module_table[1]);"</span>)))
     (js<span style="color: #c678dd;">#</span>console.log mod)
     (js<span style="color: #c678dd;">#</span>alert str))))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3d14289" class="outline-3">
<h3 id="org3d14289"><span class="section-number-3">5.3</span> Now the full gambit repl</h3>
<div class="outline-text-3" id="text-5-3">
<p>
This time we try without the module reset/init.
</p>

<div class="org-src-container">
<pre class="src src-shell">_comp lazy-gambit-repl.ss
<span style="color: #dcaeea;">_lazy</span>=<span style="color: #98be65;">"</span><span style="color: #98be65;">cat</span><span style="color: #98be65;"> lazy-gambit-repl.js </span><span style="color: #51afef; font-weight: bold;">$(</span><span style="color: #51afef; font-weight: bold;">gsc</span><span style="color: #51afef; font-weight: bold;"> -e '(display (path-expand "~~lib/_gambit.js")</span><span style="color: #98be65;">)')  &gt; gambit-repl.js"</span>
<span style="color: #ECBE7B;">echo</span> Building the gambit repl: <span style="color: #98be65;">\"</span>$<span style="color: #dcaeea;">_lazy</span><span style="color: #98be65;">\"</span>; bash -c <span style="color: #98be65;">"$_lazy"</span>;
<span style="color: #ECBE7B;">cp</span> gambit-repl.js ../public
</pre>
</div>


<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #51afef;">import</span> <span style="color: #c678dd;">:gerbil/gambit</span>)
(<span style="color: #51afef;">declare</span> (extended-bindings))

(<span style="color: #c678dd;">##</span>inline-host-statement
 <span style="color: #98be65;">"exports.evalElement = (arg) =&gt; {</span>
<span style="color: #98be65;">  alert('Lazy? This is working without the reset Hello ' + arg)</span>
<span style="color: #98be65;">}"</span>
)

(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">document.getElementById</span> id)
  (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"g_host2foreign(document.getElementById(g_scm2host(@1@)))"</span> id))

(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">Element.innerText-ref</span> elem)
  (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"g_host2scm(g_foreign2host(@1@).innerText)"</span> elem))

(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">g-sourceCodeRun</span> id)
  (<span style="color: #51afef;">let*</span> ((elem (document.getElementById id))
         (code (Element.innerText-ref elem)))
    (<span style="color: #51afef;">let</span> ((expr (cons <span style="color: #51afef;">'</span><span style="color: #c678dd;">##</span>begin (with-input-from-string code read-all))))
      (<span style="color: #51afef;">eval</span> expr))

    ))

(<span style="color: #c678dd;">##</span>inline-host-declaration <span style="color: #98be65;">"g_sourceCodeRun = function () { alert('sourceCodeRun'); };"</span>)

(<span style="color: #c678dd;">##</span>inline-host-statement <span style="color: #98be65;">"</span>
<span style="color: #98be65;">g_sourceCodeRun = g_scm2host(@1@);</span>
<span style="color: #98be65;">exports.sourceCodeRun = g_sourceCodeRun;"</span> g-sourceCodeRun)

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org0754ef4" class="outline-2">
<h2 id="org0754ef4"><span class="section-number-2">6</span> Boot File</h2>
<div class="outline-text-2" id="text-6">
<p>
Everything that lazy-loads relies on the <code>gxjs.js</code> runtime. <b>Quasar</b> has a <code>/boot</code> folder which runs things before it runs things as it were.
</p>

<p>
<a href="https://quasar.dev/quasar-cli/boot-files">https://quasar.dev/quasar-cli/boot-files</a> is a good resource.
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #51afef;">import</span> <span style="color: #98be65;">'app/public/gxjs.js'</span>
<span style="color: #51afef;">export</span> <span style="color: #51afef;">default</span> ({ app, router, store, Vue }) =&gt; {
  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">something to do</span>
}
</pre>
</div>

<p>
This must be added to <code>quasar.conf.js</code>
</p>

<div class="org-src-container">
<pre class="src src-javascript">boot: [
  <span style="color: #98be65;">'axios'</span>,
  <span style="color: #98be65;">'gxjs'</span>
],
</pre>
</div>
</div>
</div>

<div id="outline-container-org2ecae73" class="outline-2">
<h2 id="org2ecae73"><span class="section-number-2">7</span> <code>LogIndex.vue</code>, a logs component</h2>
<div class="outline-text-2" id="text-7">
<p>
Eventually this will become a lot of our code as exporting the logs to json and then <b>Vue</b>&rsquo;ing them is a wonderful task to grow code in.
</p>

<p>
For now :
</p>

<div class="org-src-container">
<pre class="src src-vue">&lt;<span style="color: #c678dd;">template</span>&gt;
      &lt;<span style="color: #c678dd;">div</span> <span style="color: #dcaeea;">class</span>=<span style="color: #98be65;">"q-pa-md"</span>&gt;
        Here is the &lt;<span style="color: #c678dd;">a</span> <span style="color: #dcaeea;">href</span>=<span style="color: #98be65;">"log/index.html"</span> <span style="color: #dcaeea;">target</span>=<span style="color: #98be65;">"log_iframe"</span>&gt; index &lt;/<span style="color: #c678dd;">a</span>&gt; of the ongoing saga that is &lt;<span style="color: #c678dd;">strong</span>&gt;<span style="font-weight: bold;">gxQuasar</span>&lt;/<span style="color: #c678dd;">strong</span>&gt;
    &lt;<span style="color: #c678dd;">q-layout</span> <span style="color: #dcaeea;">view</span>=<span style="color: #98be65;">"lHh Lpr lFf"</span> container <span style="color: #dcaeea;">style</span>=<span style="color: #98be65;">"height: 60vh"</span> <span style="color: #dcaeea;">class</span>=<span style="color: #98be65;">"shadow-2 rounded-borders"</span>&gt;
      &lt;<span style="color: #c678dd;">q-page-container</span>&gt;
        &lt;<span style="color: #c678dd;">q-page</span> padding&gt;
          &lt;<span style="color: #c678dd;">iframe</span> <span style="color: #dcaeea;">class</span>=<span style="color: #98be65;">"resp-iframe"</span>
                  <span style="color: #dcaeea;">src</span>=<span style="color: #98be65;">"log/index.html"</span>
                  <span style="color: #dcaeea;">name</span>=<span style="color: #98be65;">"log_iframe"</span>
                  <span style="color: #dcaeea;">height</span>=<span style="color: #98be65;">"50000"</span>
                  allowfullscreen&gt; &lt;/<span style="color: #c678dd;">iframe</span>&gt;
        &lt;/<span style="color: #c678dd;">q-page</span>&gt;
      &lt;/<span style="color: #c678dd;">q-page-container</span>&gt;
    &lt;/<span style="color: #c678dd;">q-layout</span>&gt;
  &lt;/<span style="color: #c678dd;">div</span>&gt;
&lt;/<span style="color: #c678dd;">template</span>&gt;

&lt;<span style="color: #c678dd;">style</span>&gt;
  .resp-iframe {
    position: absolute;
    top: 0;
    left: 0;
    width: 100%;
    height: 100%;
    border: 0;
}
&lt;/<span style="color: #c678dd;">style</span>&gt;

&lt;<span style="color: #c678dd;">script</span>&gt;
export default {
  name: 'LogIndex'
}
&lt;/<span style="color: #c678dd;">script</span>&gt;

</pre>
</div>
</div>
</div>
