log/0002_Lazy-Dynamic-Module-Init.html

<div id="outline-container-org8134045" class="outline-2">
<h2 id="org8134045"><span class="section-number-2">8</span> <code>Index.vue</code></h2>
<div class="outline-text-2" id="text-8">
<p>
Going to add the log files as html in order to have something useful to look at
live.
</p>

<div class="org-src-container">
<pre class="src src-vue">&lt;<span style="color: #c678dd;">template</span>&gt;
  &lt;<span style="color: #c678dd;">q-page</span>&gt;
    &lt;<span style="color: #c678dd;">div</span>&gt;
      &lt;<span style="color: #c678dd;">q-splitter</span>
        <span style="color: #dcaeea;">v-model</span>=<span style="color: #98be65;">"splitterModel"</span>
        &gt;

        &lt;<span style="color: #c678dd;">template</span> v-slot:before&gt;
        &lt;<span style="color: #c678dd;">q-tabs</span>
          <span style="color: #dcaeea;">v-model</span>=<span style="color: #98be65;">"tab"</span> no-caps
          vertical
          <span style="color: #dcaeea;">class</span>=<span style="color: #98be65;">"text-teal"</span>
        &gt;
          &lt;<span style="color: #c678dd;">q-tab</span> <span style="color: #dcaeea;">name</span>=<span style="color: #98be65;">"index"</span> <span style="color: #dcaeea;">icon</span>=<span style="color: #98be65;">"loyalty"</span> <span style="color: #dcaeea;">label</span>=<span style="color: #98be65;">"GerbilJS"</span> /&gt;
          &lt;<span style="color: #c678dd;">q-tab</span> <span style="color: #dcaeea;">name</span>=<span style="color: #98be65;">"repl"</span> <span style="color: #dcaeea;">icon</span>=<span style="color: #98be65;">"keyboard"</span> <span style="color: #dcaeea;">label</span>=<span style="color: #98be65;">"REPL"</span> /&gt;
          &lt;<span style="color: #c678dd;">q-tab</span> <span style="color: #dcaeea;">name</span>=<span style="color: #98be65;">"weblog"</span> <span style="color: #dcaeea;">icon</span>=<span style="color: #98be65;">"format_list_numbered"</span> <span style="color: #dcaeea;">label</span>=<span style="color: #98be65;">"Log Files"</span> /&gt;
          &lt;<span style="color: #c678dd;">q-tab</span> <span style="color: #dcaeea;">name</span>=<span style="color: #98be65;">"tests"</span> <span style="color: #dcaeea;">icon</span>=<span style="color: #98be65;">"verified"</span> <span style="color: #dcaeea;">label</span>=<span style="color: #98be65;">"Tests"</span> /&gt;
        &lt;/<span style="color: #c678dd;">q-tabs</span>&gt;
      &lt;/<span style="color: #c678dd;">template</span>&gt;

      &lt;<span style="color: #c678dd;">template</span> v-slot:after&gt;
        &lt;<span style="color: #c678dd;">q-tab-panels</span>
          <span style="color: #dcaeea;">v-model</span>=<span style="color: #98be65;">"tab"</span>
          animated
          swipeable
          vertical
          <span style="color: #dcaeea;">transition-prev</span>=<span style="color: #98be65;">"jump-up"</span>
          <span style="color: #dcaeea;">transition-next</span>=<span style="color: #98be65;">"jump-up"</span>
        &gt;
          &lt;<span style="color: #c678dd;">q-tab-panel</span> <span style="color: #dcaeea;">name</span>=<span style="color: #98be65;">"index"</span>&gt;
            &lt;<span style="color: #c678dd;">span</span> <span style="color: #dcaeea;">class</span>=<span style="color: #98be65;">"text-h4"</span>&gt;GxQuasar&lt;/<span style="color: #c678dd;">span</span>&gt;
            &lt;<span style="color: #c678dd;">span</span> <span style="color: #dcaeea;">class</span>=<span style="color: #98be65;">'text-subtitle2'</span>&gt;An overview of Gerbil Scheme in JavaScript&lt;/<span style="color: #c678dd;">span</span>&gt;
            &lt;<span style="color: #c678dd;">hr</span>&gt;
            &lt;<span style="color: #c678dd;">p</span>&gt; Developing Web Applications takes knowledge of a lot of
            languages.&lt;/<span style="color: #c678dd;">p</span>&gt;
            &lt;<span style="color: #c678dd;">p</span>&gt;Centralizing on a lisp dialect, in
            particular &lt;<span style="color: #c678dd;">a</span> <span style="color: #dcaeea;">href</span>=<span style="color: #98be65;">"https://cons.io"</span>&gt;&lt;<span style="color: #c678dd;">b</span>&gt;<span style="font-weight: bold;">Gerbil</span>&lt;/<span style="color: #c678dd;">b</span>&gt;: a meta-dialect
            of Scheme&lt;/<span style="color: #c678dd;">a</span>&gt;, makes things a lot easier. &lt;/<span style="color: #c678dd;">p</span>&gt;

            &lt;<span style="color: #c678dd;">p</span>&gt;To have a look at the code, see the &lt;<span style="color: #c678dd;">code</span>&gt;./gx/&lt;/<span style="color: #c678dd;">code</span>&gt; directory in &lt;<span style="color: #c678dd;">a</span> <span style="color: #dcaeea;">href</span>=<span style="color: #98be65;">"https://github.com/drewc/gx-quasar"</span>&gt;the github repo. &lt;/<span style="color: #c678dd;">a</span>&gt; &lt;/<span style="color: #c678dd;">p</span>&gt;

          &lt;/<span style="color: #c678dd;">q-tab-panel</span>&gt;

          &lt;<span style="color: #c678dd;">q-tab-panel</span> <span style="color: #dcaeea;">name</span>=<span style="color: #98be65;">"repl"</span>&gt;
            &lt;<span style="color: #c678dd;">div</span> <span style="color: #dcaeea;">class</span>=<span style="color: #98be65;">"text-h4 q-mb-md"</span>&gt;ReadEvalPrint(actually alert, then wait, before)Loop&lt;/<span style="color: #c678dd;">div</span>&gt;

            This is currently just a &lt;<span style="color: #c678dd;">a</span> <span style="color: #dcaeea;">href</span>=<span style="color: #98be65;">"http://gambitscheme.org/"</span>&gt;Gambit
            Scheme&lt;/<span style="color: #c678dd;">a</span>&gt; REPL. Gambit is the language that Gerbil
            currently &lt;<span style="color: #c678dd;">a</span> <span style="color: #dcaeea;">href</span>=<span style="color: #98be65;">"https://en.wikipedia.org/wiki/Source-to-source_compiler"</span>&gt;transpiles&lt;/<span style="color: #c678dd;">a</span>&gt;
            to which itself can transpile to JavaScript.

            &lt;<span style="color: #c678dd;">div</span> <span style="color: #dcaeea;">class</span>=<span style="color: #98be65;">"full-width"</span> <span style="color: #dcaeea;">contenteditable</span>=<span style="color: #98be65;">"true"</span> <span style="color: #dcaeea;">id</span>=<span style="color: #98be65;">"gx_repl"</span> <span style="color: #dcaeea;">style</span>=<span style="color: #98be65;">"max-width: 300px; height: 25vh; border: 2px solid black;"</span>&gt;
              (list "123" 456 #(7 8 9))
            &lt;/<span style="color: #c678dd;">div</span>&gt;

            &lt;<span style="color: #c678dd;">q-btn</span> <span style="color: #dcaeea;">color</span>=<span style="color: #98be65;">"red"</span> @click=<span style="color: #98be65;">"sourceCodeRun('gx_repl')"</span>&gt; Repl &lt;/<span style="color: #c678dd;">q-btn</span>&gt;
            &lt;<span style="color: #c678dd;">hr</span>&gt;

          &lt;/<span style="color: #c678dd;">q-tab-panel</span>&gt;

          &lt;<span style="color: #c678dd;">q-tab-panel</span> <span style="color: #dcaeea;">name</span>=<span style="color: #98be65;">"weblog"</span>&gt;
            &lt;<span style="color: #c678dd;">div</span> <span style="color: #dcaeea;">class</span>=<span style="color: #98be65;">"text-h4 q-mb-md"</span>&gt;Log Files&lt;/<span style="color: #c678dd;">div</span>&gt;
            &lt;<span style="color: #c678dd;">log-index</span>&gt;&lt;/<span style="color: #c678dd;">log-index</span>&gt;
          &lt;/<span style="color: #c678dd;">q-tab-panel</span>&gt;

          &lt;<span style="color: #c678dd;">q-tab-panel</span> <span style="color: #dcaeea;">name</span>=<span style="color: #98be65;">"tests"</span>&gt;
            &lt;<span style="color: #c678dd;">div</span> <span style="color: #dcaeea;">class</span>=<span style="color: #98be65;">"text-h4 q-mb-md"</span>&gt;Tests&lt;/<span style="color: #c678dd;">div</span>&gt;
            This is where the tests come to lie. Reading the logs may help to see what they are and what they do.
            &lt;<span style="color: #c678dd;">js-button-counter</span>&gt;&lt;/<span style="color: #c678dd;">js-button-counter</span>&gt;
            &lt;<span style="color: #c678dd;">button-counter</span>&gt;&lt;/<span style="color: #c678dd;">button-counter</span>&gt;
            &lt;<span style="color: #c678dd;">lazy-button-counter</span>&gt;&lt;/<span style="color: #c678dd;">lazy-button-counter</span>&gt;
            &lt;<span style="color: #c678dd;">q-btn</span> <span style="color: #dcaeea;">color</span>=<span style="color: #98be65;">"red"</span> @click=<span style="color: #98be65;">"Hello('WOrld! Tahgle!')"</span>&gt; Hello World&lt;/<span style="color: #c678dd;">q-btn</span>&gt;
            &lt;<span style="color: #c678dd;">q-btn</span> <span style="color: #dcaeea;">color</span>=<span style="color: #98be65;">"red"</span> @click=<span style="color: #98be65;">"Test('WOrld! Tahgle!')"</span>&gt; Test function&lt;/<span style="color: #c678dd;">q-btn</span>&gt;
          &lt;/<span style="color: #c678dd;">q-tab-panel</span>&gt;
        &lt;/<span style="color: #c678dd;">q-tab-panels</span>&gt;
      &lt;/<span style="color: #c678dd;">template</span>&gt;

    &lt;/<span style="color: #c678dd;">q-splitter</span>&gt;
  &lt;/<span style="color: #c678dd;">div</span>&gt;
  &lt;/<span style="color: #c678dd;">q-page</span>&gt;
&lt;/<span style="color: #c678dd;">template</span>&gt;

&lt;<span style="color: #c678dd;">script</span>&gt;
import { Hello } from 'app/public/hello.js'
import { ButtonCounter } from 'app/public/vue.js'
import { lazyButtonCounter } from 'app/public/button-counter.js'
import { Test } from 'app/public/gambit-module-test.js'
import { Loading } from 'quasar'
import LogIndex from 'components/LogIndex.vue'

import jsButtonCounter from 'app/public/test-js-component.js'

export default {
  name: 'PageIndex',
  // components: { jsButtonCounter },
  // components: { lazyButtonCounter, jsButtonCounter },
  components: { ButtonCounter, jsButtonCounter, lazyButtonCounter, LogIndex },
  data () {
    return {
      tab: 'index',
      splitterModel: 20
    }
  },
  methods: {
    Hello (arg) {
      console.log(Hello)
      // console.log(ButtonCounter)
      // console.log(lazyButtonCounter)

      window.btn = ButtonCounter
      if (typeof Hello === 'function') { Hello('Hello: ' + arg) }
    },
    Test (arg) {
      console.log(Test)
      if (typeof Test === 'function') { Test('Test: ' + arg) }
    },
    sourceCodeRun (id) {
      var scRun = false;
      // return scRun
      (async () =&gt; {
        if (!scRun) {
          Loading.show()
          const { sourceCodeRun, evalElement } = await import('app/public/gambit-repl.js')
          scRun = sourceCodeRun
          evalElement('yay!!')
          Loading.hide()
        }
        var val = scRun(id)
        alert('=&gt; ' + val)
      })()
    }
  }
}
&lt;/<span style="color: #c678dd;">script</span>&gt;
</pre>
</div>
</div>
</div>
